nxp-mcuxpresso/mcux-sdk/devices/MIMXRT758S/MIMXRT758S_hifi1.h
#define CLKCTL2_MAINPLL0CTL0_MULT_MASK           (0xFF0000U)
#define CLKCTL2_MAINPLL0CTL0_MULT_SHIFT          (16U)
/*! MULT - Multiplication Factor
 *  0b00010000..Divide by 16
 *  0b00010001..Divided by 17
 *  0b00010010..Divided by 18
 *  0b00010011..Divided by 19
 *  0b00010100..Divided by 20
 *  0b00010101..Divided by 21
 *  0b00010110..Divided by 22
 */
#define CLKCTL2_MAINPLL0CTL0_MULT(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL2_MAINPLL0CTL0_MULT_SHIFT)) & CLKCTL2_MAINPLL0CTL0_MULT_MASK)
/*! @} */

/*! @name MAINPLL0LOCKTIMEDIV2 - Main PLL0 Lock Time Div2 */
/*! @{ */

#define CLKCTL2_MAINPLL0LOCKTIMEDIV2_LOCKTIMEDIV2_MASK (0xFFFFU)
#define CLKCTL2_MAINPLL0LOCKTIMEDIV2_LOCKTIMEDIV2_SHIFT (0U)
/*! LOCKTIMEDIV2 - MAINPLL0 Lock Time Divide-by-2 */
#define CLKCTL2_MAINPLL0LOCKTIMEDIV2_LOCKTIMEDIV2(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL2_MAINPLL0LOCKTIMEDIV2_LOCKTIMEDIV2_SHIFT)) & CLKCTL2_MAINPLL0LOCKTIMEDIV2_LOCKTIMEDIV2_MASK)
/*! @} */

/*! @name MAINPLL0NUM - Main PLL0 Numerator */
/*! @{ */

#define CLKCTL2_MAINPLL0NUM_NUM_MASK             (0x3FFFFFFFU)
#define CLKCTL2_MAINPLL0NUM_NUM_SHIFT            (0U)
/*! NUM - Numerator */
#define CLKCTL2_MAINPLL0NUM_NUM(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL2_MAINPLL0NUM_NUM_SHIFT)) & CLKCTL2_MAINPLL0NUM_NUM_MASK)
/*! @} */

/*! @name MAINPLL0DENOM - Main PLL0 Denominator */
/*! @{ */

#define CLKCTL2_MAINPLL0DENOM_DENOM_MASK         (0x3FFFFFFFU)
#define CLKCTL2_MAINPLL0DENOM_DENOM_SHIFT        (0U)
/*! DENOM - Denominator */
#define CLKCTL2_MAINPLL0DENOM_DENOM(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL2_MAINPLL0DENOM_DENOM_SHIFT)) & CLKCTL2_MAINPLL0DENOM_DENOM_MASK)
/*! @} */

/*! @name MAINPLL0PFD - Main PLL0 PFD */
/*! @{ */

#define CLKCTL2_MAINPLL0PFD_PFD0_MASK            (0x3FU)
#define CLKCTL2_MAINPLL0PFD_PFD0_SHIFT           (0U)
/*! PFD0 - PLL Fractional Divider 0 */
#define CLKCTL2_MAINPLL0PFD_PFD0(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL2_MAINPLL0PFD_PFD0_SHIFT)) & CLKCTL2_MAINPLL0PFD_PFD0_MASK)

#define CLKCTL2_MAINPLL0PFD_PFD0_CLKRDY_MASK     (0x40U)
#define CLKCTL2_MAINPLL0PFD_PFD0_CLKRDY_SHIFT    (6U)
/*! PFD0_CLKRDY - PFD0 Clock Ready
 *  0b0..PFD0 clock is not ready.
 *  0b1..PFD0 clock is ready.
 */
#define CLKCTL2_MAINPLL0PFD_PFD0_CLKRDY(x)       (((uint32_t)(((uint32_t)(x)) << CLKCTL2_MAINPLL0PFD_PFD0_CLKRDY_SHIFT)) & CLKCTL2_MAINPLL0PFD_PFD0_CLKRDY_MASK)

#define CLKCTL2_MAINPLL0PFD_PFD0_CLKGATE_MASK    (0x80U)
#define CLKCTL2_MAINPLL0PFD_PFD0_CLKGATE_SHIFT   (7U)
/*! PFD0_CLKGATE - PFD0 Clock Gate
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL2_MAINPLL0PFD_PFD0_CLKGATE(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL2_MAINPLL0PFD_PFD0_CLKGATE_SHIFT)) & CLKCTL2_MAINPLL0PFD_PFD0_CLKGATE_MASK)

#define CLKCTL2_MAINPLL0PFD_PFD1_MASK            (0x3F00U)
#define CLKCTL2_MAINPLL0PFD_PFD1_SHIFT           (8U)
/*! PFD1 - PLL Fractional Divider 1 */
#define CLKCTL2_MAINPLL0PFD_PFD1(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL2_MAINPLL0PFD_PFD1_SHIFT)) & CLKCTL2_MAINPLL0PFD_PFD1_MASK)

#define CLKCTL2_MAINPLL0PFD_PFD1_CLKRDY_MASK     (0x4000U)
#define CLKCTL2_MAINPLL0PFD_PFD1_CLKRDY_SHIFT    (14U)
/*! PFD1_CLKRDY - PFD1 Clock Ready
 *  0b0..PFD1 clock is not ready.
 *  0b1..PFD1 clock is ready.
 */
#define CLKCTL2_MAINPLL0PFD_PFD1_CLKRDY(x)       (((uint32_t)(((uint32_t)(x)) << CLKCTL2_MAINPLL0PFD_PFD1_CLKRDY_SHIFT)) & CLKCTL2_MAINPLL0PFD_PFD1_CLKRDY_MASK)

#define CLKCTL2_MAINPLL0PFD_PFD1_CLKGATE_MASK    (0x8000U)
#define CLKCTL2_MAINPLL0PFD_PFD1_CLKGATE_SHIFT   (15U)
/*! PFD1_CLKGATE - PFD1 Clock Gate
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL2_MAINPLL0PFD_PFD1_CLKGATE(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL2_MAINPLL0PFD_PFD1_CLKGATE_SHIFT)) & CLKCTL2_MAINPLL0PFD_PFD1_CLKGATE_MASK)

#define CLKCTL2_MAINPLL0PFD_PFD2_MASK            (0x3F0000U)
#define CLKCTL2_MAINPLL0PFD_PFD2_SHIFT           (16U)
/*! PFD2 - PLL Fractional Divider 2 */
#define CLKCTL2_MAINPLL0PFD_PFD2(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL2_MAINPLL0PFD_PFD2_SHIFT)) & CLKCTL2_MAINPLL0PFD_PFD2_MASK)

#define CLKCTL2_MAINPLL0PFD_PFD2_CLKRDY_MASK     (0x400000U)
#define CLKCTL2_MAINPLL0PFD_PFD2_CLKRDY_SHIFT    (22U)
/*! PFD2_CLKRDY - PFD2 Clock Ready
 *  0b0..PFD2 clock is not ready.
 *  0b1..PFD2 clock is ready.
 */
#define CLKCTL2_MAINPLL0PFD_PFD2_CLKRDY(x)       (((uint32_t)(((uint32_t)(x)) << CLKCTL2_MAINPLL0PFD_PFD2_CLKRDY_SHIFT)) & CLKCTL2_MAINPLL0PFD_PFD2_CLKRDY_MASK)

#define CLKCTL2_MAINPLL0PFD_PFD2_CLKGATE_MASK    (0x800000U)
#define CLKCTL2_MAINPLL0PFD_PFD2_CLKGATE_SHIFT   (23U)
/*! PFD2_CLKGATE - PFD2 Clock Gate
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL2_MAINPLL0PFD_PFD2_CLKGATE(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL2_MAINPLL0PFD_PFD2_CLKGATE_SHIFT)) & CLKCTL2_MAINPLL0PFD_PFD2_CLKGATE_MASK)

#define CLKCTL2_MAINPLL0PFD_PFD3_MASK            (0x3F000000U)
#define CLKCTL2_MAINPLL0PFD_PFD3_SHIFT           (24U)
/*! PFD3 - PLL Fractional Divider 3 */
#define CLKCTL2_MAINPLL0PFD_PFD3(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL2_MAINPLL0PFD_PFD3_SHIFT)) & CLKCTL2_MAINPLL0PFD_PFD3_MASK)

#define CLKCTL2_MAINPLL0PFD_PFD3_CLKRDY_MASK     (0x40000000U)
#define CLKCTL2_MAINPLL0PFD_PFD3_CLKRDY_SHIFT    (30U)
/*! PFD3_CLKRDY - PFD3 Clock Ready
 *  0b0..PFD3 clock is not ready.
 *  0b1..PFD3 clock is ready.
 */
#define CLKCTL2_MAINPLL0PFD_PFD3_CLKRDY(x)       (((uint32_t)(((uint32_t)(x)) << CLKCTL2_MAINPLL0PFD_PFD3_CLKRDY_SHIFT)) & CLKCTL2_MAINPLL0PFD_PFD3_CLKRDY_MASK)

#define CLKCTL2_MAINPLL0PFD_PFD3_CLKGATE_MASK    (0x80000000U)
#define CLKCTL2_MAINPLL0PFD_PFD3_CLKGATE_SHIFT   (31U)
/*! PFD3_CLKGATE - PFD3 Clock Gate
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL2_MAINPLL0PFD_PFD3_CLKGATE(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL2_MAINPLL0PFD_PFD3_CLKGATE_SHIFT)) & CLKCTL2_MAINPLL0PFD_PFD3_CLKGATE_MASK)
/*! @} */

/*! @name MAINPLL0PFDDOMAINEN - Main PLL0 PFD Clock Domain Enable */
/*! @{ */

#define CLKCTL2_MAINPLL0PFDDOMAINEN_PFD0_OF_CMPT_MASK (0x1U)
#define CLKCTL2_MAINPLL0PFDDOMAINEN_PFD0_OF_CMPT_SHIFT (0U)
/*! PFD0_OF_CMPT - PFD0 of VDD2_COMP Domain
 *  0b1..Enable
 *  0b0..Disable
 */
#define CLKCTL2_MAINPLL0PFDDOMAINEN_PFD0_OF_CMPT(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL2_MAINPLL0PFDDOMAINEN_PFD0_OF_CMPT_SHIFT)) & CLKCTL2_MAINPLL0PFDDOMAINEN_PFD0_OF_CMPT_MASK)

#define CLKCTL2_MAINPLL0PFDDOMAINEN_PFD0_OF_VDD1_SENSE_MASK (0x2U)
#define CLKCTL2_MAINPLL0PFDDOMAINEN_PFD0_OF_VDD1_SENSE_SHIFT (1U)
/*! PFD0_OF_VDD1_SENSE - PFD0 of VDD1_SENSE Domain
 *  0b1..Enable
 *  0b0..Disable
 */
#define CLKCTL2_MAINPLL0PFDDOMAINEN_PFD0_OF_VDD1_SENSE(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL2_MAINPLL0PFDDOMAINEN_PFD0_OF_VDD1_SENSE_SHIFT)) & CLKCTL2_MAINPLL0PFDDOMAINEN_PFD0_OF_VDD1_SENSE_MASK)

#define CLKCTL2_MAINPLL0PFDDOMAINEN_PFD0_OF_VDD2_DSP_MASK (0x4U)
#define CLKCTL2_MAINPLL0PFDDOMAINEN_PFD0_OF_VDD2_DSP_SHIFT (2U)
/*! PFD0_OF_VDD2_DSP - PFD0 of VDD2_DSP Domain
 *  0b1..Enable
 *  0b0..Disable
 */
#define CLKCTL2_MAINPLL0PFDDOMAINEN_PFD0_OF_VDD2_DSP(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL2_MAINPLL0PFDDOMAINEN_PFD0_OF_VDD2_DSP_SHIFT)) & CLKCTL2_MAINPLL0PFDDOMAINEN_PFD0_OF_VDD2_DSP_MASK)

