nxp-mcuxpresso/mcux-sdk/devices/MIMXRT758S/MIMXRT758S_hifi1.h
#define I3C_MDYNADDR_DADDR_MASK                  (0xFEU)
#define I3C_MDYNADDR_DADDR_SHIFT                 (1U)
/*! DADDR - Dynamic Address */
#define I3C_MDYNADDR_DADDR(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_MDYNADDR_DADDR_SHIFT)) & I3C_MDYNADDR_DADDR_MASK)
/*! @} */

/*! @name SMAPCTRL0 - Map Feature Control 0 */
/*! @{ */

#define I3C_SMAPCTRL0_ENA_MASK                   (0x1U)
#define I3C_SMAPCTRL0_ENA_SHIFT                  (0U)
/*! ENA - Enable Primary Dynamic Address
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define I3C_SMAPCTRL0_ENA(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_SMAPCTRL0_ENA_SHIFT)) & I3C_SMAPCTRL0_ENA_MASK)

#define I3C_SMAPCTRL0_DA_MASK                    (0xFEU)
#define I3C_SMAPCTRL0_DA_SHIFT                   (1U)
/*! DA - Dynamic Address */
#define I3C_SMAPCTRL0_DA(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_SMAPCTRL0_DA_SHIFT)) & I3C_SMAPCTRL0_DA_MASK)

#define I3C_SMAPCTRL0_CAUSE_MASK                 (0x700U)
#define I3C_SMAPCTRL0_CAUSE_SHIFT                (8U)
/*! CAUSE - Cause
 *  0b000..No information (this value occurs when not configured to write DA)
 *  0b001..Set using ENTDAA
 *  0b010..Set using SETDASA, SETAASA, or SETNEWDA
 *  0b011..Cleared using RSTDAA
 *  0b100..Auto MAP change happened last
 *  *..
 */
#define I3C_SMAPCTRL0_CAUSE(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_SMAPCTRL0_CAUSE_SHIFT)) & I3C_SMAPCTRL0_CAUSE_MASK)
/*! @} */

/*! @name IBIEXT1 - Extended IBI Data 1 */
/*! @{ */

#define I3C_IBIEXT1_CNT_MASK                     (0x7U)
#define I3C_IBIEXT1_CNT_SHIFT                    (0U)
/*! CNT - Count */
#define I3C_IBIEXT1_CNT(x)                       (((uint32_t)(((uint32_t)(x)) << I3C_IBIEXT1_CNT_SHIFT)) & I3C_IBIEXT1_CNT_MASK)

#define I3C_IBIEXT1_MAX_MASK                     (0x70U)
#define I3C_IBIEXT1_MAX_SHIFT                    (4U)
/*! MAX - Maximum */
#define I3C_IBIEXT1_MAX(x)                       (((uint32_t)(((uint32_t)(x)) << I3C_IBIEXT1_MAX_SHIFT)) & I3C_IBIEXT1_MAX_MASK)

#define I3C_IBIEXT1_EXT1_MASK                    (0xFF00U)
#define I3C_IBIEXT1_EXT1_SHIFT                   (8U)
/*! EXT1 - Extra Byte 1 */
#define I3C_IBIEXT1_EXT1(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_IBIEXT1_EXT1_SHIFT)) & I3C_IBIEXT1_EXT1_MASK)

#define I3C_IBIEXT1_EXT2_MASK                    (0xFF0000U)
#define I3C_IBIEXT1_EXT2_SHIFT                   (16U)
/*! EXT2 - Extra Byte 2 */
#define I3C_IBIEXT1_EXT2(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_IBIEXT1_EXT2_SHIFT)) & I3C_IBIEXT1_EXT2_MASK)

#define I3C_IBIEXT1_EXT3_MASK                    (0xFF000000U)
#define I3C_IBIEXT1_EXT3_SHIFT                   (24U)
/*! EXT3 - Extra Byte 3 */
#define I3C_IBIEXT1_EXT3(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_IBIEXT1_EXT3_SHIFT)) & I3C_IBIEXT1_EXT3_MASK)
/*! @} */

/*! @name IBIEXT2 - Extended IBI Data 2 */
/*! @{ */

#define I3C_IBIEXT2_EXT4_MASK                    (0xFFU)
#define I3C_IBIEXT2_EXT4_SHIFT                   (0U)
/*! EXT4 - Extra Byte 4 */
#define I3C_IBIEXT2_EXT4(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_IBIEXT2_EXT4_SHIFT)) & I3C_IBIEXT2_EXT4_MASK)

#define I3C_IBIEXT2_EXT5_MASK                    (0xFF00U)
#define I3C_IBIEXT2_EXT5_SHIFT                   (8U)
/*! EXT5 - Extra Byte 5 */
#define I3C_IBIEXT2_EXT5(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_IBIEXT2_EXT5_SHIFT)) & I3C_IBIEXT2_EXT5_MASK)

#define I3C_IBIEXT2_EXT6_MASK                    (0xFF0000U)
#define I3C_IBIEXT2_EXT6_SHIFT                   (16U)
/*! EXT6 - Extra Byte 6 */
#define I3C_IBIEXT2_EXT6(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_IBIEXT2_EXT6_SHIFT)) & I3C_IBIEXT2_EXT6_MASK)

#define I3C_IBIEXT2_EXT7_MASK                    (0xFF000000U)
#define I3C_IBIEXT2_EXT7_SHIFT                   (24U)
/*! EXT7 - Extra Byte 7 */
#define I3C_IBIEXT2_EXT7(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_IBIEXT2_EXT7_SHIFT)) & I3C_IBIEXT2_EXT7_MASK)
/*! @} */

/*! @name SID - Target Module ID */
/*! @{ */

#define I3C_SID_ID_MASK                          (0xFFFFFFFFU)
#define I3C_SID_ID_SHIFT                         (0U)
/*! ID - ID */
#define I3C_SID_ID(x)                            (((uint32_t)(((uint32_t)(x)) << I3C_SID_ID_SHIFT)) & I3C_SID_ID_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group I3C_Register_Masks */


/* I3C - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral I3C2 base address */
  #define I3C2_BASE                                (0x50056000u)
  /** Peripheral I3C2 base address */
  #define I3C2_BASE_NS                             (0x40056000u)
  /** Peripheral I3C2 base pointer */
  #define I3C2                                     ((I3C_Type *)I3C2_BASE)
  /** Peripheral I3C2 base pointer */
  #define I3C2_NS                                  ((I3C_Type *)I3C2_BASE_NS)
  /** Peripheral I3C3 base address */
  #define I3C3_BASE                                (0x50057000u)
  /** Peripheral I3C3 base address */
  #define I3C3_BASE_NS                             (0x40057000u)
  /** Peripheral I3C3 base pointer */
  #define I3C3                                     ((I3C_Type *)I3C3_BASE)
  /** Peripheral I3C3 base pointer */
  #define I3C3_NS                                  ((I3C_Type *)I3C3_BASE_NS)
  /** Array initializer of I3C peripheral base addresses */
  #define I3C_BASE_ADDRS                           { 0u, 0u, I3C2_BASE, I3C3_BASE }
  /** Array initializer of I3C peripheral base pointers */
  #define I3C_BASE_PTRS                            { (I3C_Type *)0u, (I3C_Type *)0u, I3C2, I3C3 }
  /** Array initializer of I3C peripheral base addresses */
  #define I3C_BASE_ADDRS_NS                        { 0u, 0u, I3C2_BASE_NS, I3C3_BASE_NS }
  /** Array initializer of I3C peripheral base pointers */
  #define I3C_BASE_PTRS_NS                         { (I3C_Type *)0u, (I3C_Type *)0u, I3C2_NS, I3C3_NS }
#else
  /** Peripheral I3C2 base address */
  #define I3C2_BASE                                (0x40056000u)
  /** Peripheral I3C2 base pointer */
  #define I3C2                                     ((I3C_Type *)I3C2_BASE)
  /** Peripheral I3C3 base address */
  #define I3C3_BASE                                (0x40057000u)
  /** Peripheral I3C3 base pointer */
  #define I3C3                                     ((I3C_Type *)I3C3_BASE)
  /** Array initializer of I3C peripheral base addresses */
  #define I3C_BASE_ADDRS                           { 0u, 0u, I3C2_BASE, I3C3_BASE }
  /** Array initializer of I3C peripheral base pointers */
  #define I3C_BASE_PTRS                            { (I3C_Type *)0u, (I3C_Type *)0u, I3C2, I3C3 }
#endif
/** Interrupt vectors for the I3C peripheral type */
#define I3C_IRQS                                 { NotAvail_IRQn, NotAvail_IRQn, I3C2_IRQn, I3C3_IRQn }

/*!
 * @}
 */ /* end of group I3C_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- INPUTMUX Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup INPUTMUX_Peripheral_Access_Layer INPUTMUX Peripheral Access Layer
 * @{
 */

/** INPUTMUX - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[256];
  __IO uint32_t PINT1_TRIG[4];                     /**< PINT1 Input Connections, array offset: 0x100, array step: 0x4 */
       uint8_t RESERVED_1[48];
  __IO uint32_t HIFI1_INTERRUPT[27];               /**< HiFi1 Interrupt Connections, array offset: 0x140, array step: 0x4 */
       uint8_t RESERVED_2[84];
  struct {                                         /* offset: 0x200, array step: 0x20 */
    __IO uint32_t LP_FLEXCOMM_TRIG;                  /**< LP_FLEXCOMM Input Connections, array offset: 0x200, array step: 0x20 */
         uint8_t RESERVED_0[28];
  } FLEXCOMM_TRIG[4];
       uint8_t RESERVED_3[384];
  __IO uint32_t ADC0_TRIG[2];                      /**< ADC0 Input Connections, array offset: 0x400, array step: 0x4 */
       uint8_t RESERVED_4[504];
  struct {                                         /* offset: 0x600, array step: 0x20 */
    __IO uint32_t CAP[4];                            /**< CTIMER Input Connections, array offset: 0x600, array step: index*0x20, index2*0x4 */
    __IO uint32_t TRIG;                              /**< CTIMER Input Connections, array offset: 0x610, array step: 0x20 */
         uint8_t RESERVED_0[12];
  } CTIMER[3];
} INPUTMUX_Type;

/* ----------------------------------------------------------------------------
   -- INPUTMUX Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup INPUTMUX_Register_Masks INPUTMUX Register Masks
 * @{
 */

/*! @name PINT1_TRIG - PINT1 Input Connections */
/*! @{ */

#define INPUTMUX_PINT1_TRIG_TRIGIN_MASK          (0x3FU)
#define INPUTMUX_PINT1_TRIG_TRIGIN_SHIFT         (0U)
/*! TRIGIN - PINT1 Input Trigger
 *  0b000000..Selects PIO8_0
 *  0b000001..Selects PIO8_1
 *  0b000010..Selects PIO8_2
 *  0b000011..Selects PIO8_3
 *  0b000100..Selects PIO8_4
 *  0b000101..Selects PIO8_5
 *  0b000110..Selects PIO8_6
 *  0b000111..Selects PIO8_7
 *  0b001000..Selects PIO8_8
 *  0b001001..Selects PIO8_9
 *  0b001010..Selects PIO8_10
 *  0b001011..Selects PIO8_11
 *  0b001100..Selects PIO8_12
 *  0b001101..Selects PIO8_13
 *  0b001110..Selects PIO8_14
 *  0b001111..Selects PIO8_15
 *  0b010000..Selects PIO8_16
 *  0b010001..Selects PIO8_17
 *  0b010010..Selects PIO8_18
 *  0b010011..Selects PIO8_19
 *  0b010100..Selects PIO8_20
 *  0b010101..Selects PIO8_21
 *  0b010110..Selects PIO8_22
 *  0b010111..Selects PIO8_23
 *  0b011000..Selects PIO8_24
 *  0b011001..Selects PIO8_25
 *  0b011010..Selects PIO8_26
 *  0b011011..Selects PIO8_27
 *  0b011100..Selects PIO8_28
 *  0b011101..Selects PIO8_29
 *  0b011110..Selects PIO8_30
 *  0b011111..Selects PIO8_31
 *  0b100000..Selects PIO10_0
 *  0b100001..Selects PIO10_1
 *  0b100010..Selects PIO10_2
 *  0b100011..Selects PIO10_3
 *  0b100100..Selects PIO10_4
 *  0b100101..Selects PIO10_5
 *  0b100110..Selects PIO10_6
 *  0b100111..Selects PIO10_7
 *  0b101000..Selects PIO10_8
 *  0b101001..Selects PIO10_9
 *  0b101010..Selects PIO10_10
 *  0b101011..Selects PIO10_11
 *  0b101100..Selects PIO10_12
 *  0b101101..Selects PIO10_13
 *  0b101110..Selects PIO10_14
 *  0b101111..Selects PIO10_15
 *  0b110000..Selects PIO10_16
 *  0b110001..Selects PIO10_17
 *  *..
 */
#define INPUTMUX_PINT1_TRIG_TRIGIN(x)            (((uint32_t)(((uint32_t)(x)) << INPUTMUX_PINT1_TRIG_TRIGIN_SHIFT)) & INPUTMUX_PINT1_TRIG_TRIGIN_MASK)
/*! @} */

