nxp-mcuxpresso/mcux-sdk/devices/MIMXRT758S/MIMXRT758S_hifi1.h
#define IOPCTL1_PIO_FSEL_MASK                    (0xFU)
#define IOPCTL1_PIO_FSEL_SHIFT                   (0U)
/*! FSEL - Function Selector (Digital Function)
 *  0b0000..Function 0
 *  0b0001..Function 1
 *  0b0010..Function 2
 *  0b0011..Function 3
 *  0b0100..Function 4
 *  0b0101..Function 5
 *  0b0110..Function 6
 *  0b0111..Function 7
 */
#define IOPCTL1_PIO_FSEL(x)                      (((uint32_t)(((uint32_t)(x)) << IOPCTL1_PIO_FSEL_SHIFT)) & IOPCTL1_PIO_FSEL_MASK)

#define IOPCTL1_PIO_PUPDENA_MASK                 (0x10U)
#define IOPCTL1_PIO_PUPDENA_SHIFT                (4U)
/*! PUPDENA - Pullup / Pulldown Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define IOPCTL1_PIO_PUPDENA(x)                   (((uint32_t)(((uint32_t)(x)) << IOPCTL1_PIO_PUPDENA_SHIFT)) & IOPCTL1_PIO_PUPDENA_MASK)

#define IOPCTL1_PIO_PUPDSEL_MASK                 (0x20U)
#define IOPCTL1_PIO_PUPDSEL_SHIFT                (5U)
/*! PUPDSEL - Pullup or Pulldown Selector
 *  0b0..Enables the internal pull-down resistor.
 *  0b1..Enables the internal pull-up resistor.
 */
#define IOPCTL1_PIO_PUPDSEL(x)                   (((uint32_t)(((uint32_t)(x)) << IOPCTL1_PIO_PUPDSEL_SHIFT)) & IOPCTL1_PIO_PUPDSEL_MASK)

#define IOPCTL1_PIO_IBENA_MASK                   (0x40U)
#define IOPCTL1_PIO_IBENA_SHIFT                  (6U)
/*! IBENA - Input Buffer Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define IOPCTL1_PIO_IBENA(x)                     (((uint32_t)(((uint32_t)(x)) << IOPCTL1_PIO_IBENA_SHIFT)) & IOPCTL1_PIO_IBENA_MASK)

#define IOPCTL1_PIO_SLEWRATE_MASK                (0x80U)
#define IOPCTL1_PIO_SLEWRATE_SHIFT               (7U)
/*! SLEWRATE - Slew Rate Control
 *  0b0..Disables. Standard mode.
 *  0b1..Enables. Slow mode.
 */
#define IOPCTL1_PIO_SLEWRATE(x)                  (((uint32_t)(((uint32_t)(x)) << IOPCTL1_PIO_SLEWRATE_SHIFT)) & IOPCTL1_PIO_SLEWRATE_MASK)

#define IOPCTL1_PIO_FULLDRIVE_MASK               (0x100U)
#define IOPCTL1_PIO_FULLDRIVE_SHIFT              (8U)
/*! FULLDRIVE - Drive Selector
 *  0b0..Normal output drive
 *  0b1..Full output drive, twice the drive of normal mode.
 */
#define IOPCTL1_PIO_FULLDRIVE(x)                 (((uint32_t)(((uint32_t)(x)) << IOPCTL1_PIO_FULLDRIVE_SHIFT)) & IOPCTL1_PIO_FULLDRIVE_MASK)

#define IOPCTL1_PIO_AMENA_MASK                   (0x200U)
#define IOPCTL1_PIO_AMENA_SHIFT                  (9U)
/*! AMENA - Analog Mux Enable
 *  0b0..Disables for digital pin function
 *  0b1..Enables for analog pin function
 */
#define IOPCTL1_PIO_AMENA(x)                     (((uint32_t)(((uint32_t)(x)) << IOPCTL1_PIO_AMENA_SHIFT)) & IOPCTL1_PIO_AMENA_MASK)

#define IOPCTL1_PIO_ODENA_MASK                   (0x400U)
#define IOPCTL1_PIO_ODENA_SHIFT                  (10U)
/*! ODENA - Open-drain Mode Enable
 *  0b0..Disables for Normal push-pull output
 *  0b1..Enables for open-drain output (high drive is disabled)
 */
#define IOPCTL1_PIO_ODENA(x)                     (((uint32_t)(((uint32_t)(x)) << IOPCTL1_PIO_ODENA_SHIFT)) & IOPCTL1_PIO_ODENA_MASK)

#define IOPCTL1_PIO_IIENA_MASK                   (0x800U)
#define IOPCTL1_PIO_IIENA_SHIFT                  (11U)
/*! IIENA - Input Invert Enable
 *  0b0..Disables. Input function is not inverted
 *  0b1..Enables, input is function inverted
 */
#define IOPCTL1_PIO_IIENA(x)                     (((uint32_t)(((uint32_t)(x)) << IOPCTL1_PIO_IIENA_SHIFT)) & IOPCTL1_PIO_IIENA_MASK)
/*! @} */

/* The count of IOPCTL1_PIO */
#define IOPCTL1_PIO_COUNT                        (3U)

/* The count of IOPCTL1_PIO */
#define IOPCTL1_PIO_COUNT2                       (32U)

/*! @name PMIC_I2C_SDA - PMIC_I2C_SDA */
/*! @{ */

#define IOPCTL1_PMIC_I2C_SDA_PUPDENA_MASK        (0x10U)
#define IOPCTL1_PMIC_I2C_SDA_PUPDENA_SHIFT       (4U)
/*! PUPDENA - Pullup / Pulldown Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define IOPCTL1_PMIC_I2C_SDA_PUPDENA(x)          (((uint32_t)(((uint32_t)(x)) << IOPCTL1_PMIC_I2C_SDA_PUPDENA_SHIFT)) & IOPCTL1_PMIC_I2C_SDA_PUPDENA_MASK)

#define IOPCTL1_PMIC_I2C_SDA_PUPDSEL_MASK        (0x20U)
#define IOPCTL1_PMIC_I2C_SDA_PUPDSEL_SHIFT       (5U)
/*! PUPDSEL - Pullup or Pulldown Selector
 *  0b0..Enables the internal pull-down resistor.
 *  0b1..Enables the internal pull-up resistor.
 */
#define IOPCTL1_PMIC_I2C_SDA_PUPDSEL(x)          (((uint32_t)(((uint32_t)(x)) << IOPCTL1_PMIC_I2C_SDA_PUPDSEL_SHIFT)) & IOPCTL1_PMIC_I2C_SDA_PUPDSEL_MASK)

#define IOPCTL1_PMIC_I2C_SDA_IBENA_MASK          (0x40U)
#define IOPCTL1_PMIC_I2C_SDA_IBENA_SHIFT         (6U)
/*! IBENA - Input Buffer Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define IOPCTL1_PMIC_I2C_SDA_IBENA(x)            (((uint32_t)(((uint32_t)(x)) << IOPCTL1_PMIC_I2C_SDA_IBENA_SHIFT)) & IOPCTL1_PMIC_I2C_SDA_IBENA_MASK)

#define IOPCTL1_PMIC_I2C_SDA_SLEWRATE_MASK       (0x80U)
#define IOPCTL1_PMIC_I2C_SDA_SLEWRATE_SHIFT      (7U)
/*! SLEWRATE - Slew Rate Control
 *  0b0..Disables, in standard mode.
 *  0b1..Enables, in slow mode.
 */
#define IOPCTL1_PMIC_I2C_SDA_SLEWRATE(x)         (((uint32_t)(((uint32_t)(x)) << IOPCTL1_PMIC_I2C_SDA_SLEWRATE_SHIFT)) & IOPCTL1_PMIC_I2C_SDA_SLEWRATE_MASK)

#define IOPCTL1_PMIC_I2C_SDA_FULLDRIVE_MASK      (0x100U)
#define IOPCTL1_PMIC_I2C_SDA_FULLDRIVE_SHIFT     (8U)
/*! FULLDRIVE - Drive Selector
 *  0b0..Normal output drive
 *  0b1..Full output drive, twice the drive of normal mode.
 */
#define IOPCTL1_PMIC_I2C_SDA_FULLDRIVE(x)        (((uint32_t)(((uint32_t)(x)) << IOPCTL1_PMIC_I2C_SDA_FULLDRIVE_SHIFT)) & IOPCTL1_PMIC_I2C_SDA_FULLDRIVE_MASK)

#define IOPCTL1_PMIC_I2C_SDA_AMENA_MASK          (0x200U)
#define IOPCTL1_PMIC_I2C_SDA_AMENA_SHIFT         (9U)
/*! AMENA - Analog Mux Enable
 *  0b0..Disables for digital pin function
 *  0b1..Enables for analog pin function
 */
#define IOPCTL1_PMIC_I2C_SDA_AMENA(x)            (((uint32_t)(((uint32_t)(x)) << IOPCTL1_PMIC_I2C_SDA_AMENA_SHIFT)) & IOPCTL1_PMIC_I2C_SDA_AMENA_MASK)

#define IOPCTL1_PMIC_I2C_SDA_ODENA_MASK          (0x400U)
#define IOPCTL1_PMIC_I2C_SDA_ODENA_SHIFT         (10U)
/*! ODENA - Open-drain Mode Enable
 *  0b0..Disables for normal push-pull output
 *  0b1..Enables for simulated open-drain output (high drive disabled)
 */
#define IOPCTL1_PMIC_I2C_SDA_ODENA(x)            (((uint32_t)(((uint32_t)(x)) << IOPCTL1_PMIC_I2C_SDA_ODENA_SHIFT)) & IOPCTL1_PMIC_I2C_SDA_ODENA_MASK)

#define IOPCTL1_PMIC_I2C_SDA_IIENA_MASK          (0x800U)
#define IOPCTL1_PMIC_I2C_SDA_IIENA_SHIFT         (11U)
/*! IIENA - Input Invert Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define IOPCTL1_PMIC_I2C_SDA_IIENA(x)            (((uint32_t)(((uint32_t)(x)) << IOPCTL1_PMIC_I2C_SDA_IIENA_SHIFT)) & IOPCTL1_PMIC_I2C_SDA_IIENA_MASK)
/*! @} */

/*! @name PMIC_I2C_SCL - PMIC_I2C_SCL */
/*! @{ */

#define IOPCTL1_PMIC_I2C_SCL_PUPDENA_MASK        (0x10U)
#define IOPCTL1_PMIC_I2C_SCL_PUPDENA_SHIFT       (4U)
/*! PUPDENA - Pullup / Pulldown Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define IOPCTL1_PMIC_I2C_SCL_PUPDENA(x)          (((uint32_t)(((uint32_t)(x)) << IOPCTL1_PMIC_I2C_SCL_PUPDENA_SHIFT)) & IOPCTL1_PMIC_I2C_SCL_PUPDENA_MASK)

#define IOPCTL1_PMIC_I2C_SCL_PUPDSEL_MASK        (0x20U)
#define IOPCTL1_PMIC_I2C_SCL_PUPDSEL_SHIFT       (5U)
/*! PUPDSEL - Pullup or Pulldown Selector
 *  0b0..Enables the internal pull-down resistor.
 *  0b1..Enables the internal pull-up resistor.
 */
#define IOPCTL1_PMIC_I2C_SCL_PUPDSEL(x)          (((uint32_t)(((uint32_t)(x)) << IOPCTL1_PMIC_I2C_SCL_PUPDSEL_SHIFT)) & IOPCTL1_PMIC_I2C_SCL_PUPDSEL_MASK)

#define IOPCTL1_PMIC_I2C_SCL_IBENA_MASK          (0x40U)
#define IOPCTL1_PMIC_I2C_SCL_IBENA_SHIFT         (6U)
/*! IBENA - Input Buffer Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define IOPCTL1_PMIC_I2C_SCL_IBENA(x)            (((uint32_t)(((uint32_t)(x)) << IOPCTL1_PMIC_I2C_SCL_IBENA_SHIFT)) & IOPCTL1_PMIC_I2C_SCL_IBENA_MASK)

#define IOPCTL1_PMIC_I2C_SCL_SLEWRATE_MASK       (0x80U)
#define IOPCTL1_PMIC_I2C_SCL_SLEWRATE_SHIFT      (7U)
/*! SLEWRATE - Slew Rate Control
 *  0b0..Disables. Standard mode.
 *  0b1..Enables. Slow mode.
 */
#define IOPCTL1_PMIC_I2C_SCL_SLEWRATE(x)         (((uint32_t)(((uint32_t)(x)) << IOPCTL1_PMIC_I2C_SCL_SLEWRATE_SHIFT)) & IOPCTL1_PMIC_I2C_SCL_SLEWRATE_MASK)

#define IOPCTL1_PMIC_I2C_SCL_FULLDRIVE_MASK      (0x100U)
#define IOPCTL1_PMIC_I2C_SCL_FULLDRIVE_SHIFT     (8U)
/*! FULLDRIVE - Drive Selector
 *  0b0..Normal output drive
 *  0b1..Full output drive, twice the drive of normal mode.
 */
#define IOPCTL1_PMIC_I2C_SCL_FULLDRIVE(x)        (((uint32_t)(((uint32_t)(x)) << IOPCTL1_PMIC_I2C_SCL_FULLDRIVE_SHIFT)) & IOPCTL1_PMIC_I2C_SCL_FULLDRIVE_MASK)

