nxp-mcuxpresso/mcux-sdk/devices/MIMXRT758S/MIMXRT758S_hifi1.h
#define PMC_INTRCTRL_SCP2OCIE_MASK               (0x100U)
#define PMC_INTRCTRL_SCP2OCIE_SHIFT              (8U)
/*! SCP2OCIE - SCPC VDD2 Overcurrent Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define PMC_INTRCTRL_SCP2OCIE(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_INTRCTRL_SCP2OCIE_SHIFT)) & PMC_INTRCTRL_SCP2OCIE_MASK)

#define PMC_INTRCTRL_DCHPOCIE_MASK               (0x200U)
#define PMC_INTRCTRL_DCHPOCIE_SHIFT              (9U)
/*! DCHPOCIE - DCDC High-Power Overcurrent Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define PMC_INTRCTRL_DCHPOCIE(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_INTRCTRL_DCHPOCIE_SHIFT)) & PMC_INTRCTRL_DCHPOCIE_MASK)

#define PMC_INTRCTRL_DCLPOCIE_MASK               (0x400U)
#define PMC_INTRCTRL_DCLPOCIE_SHIFT              (10U)
/*! DCLPOCIE - DCDC Low-Power Overcurrent Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define PMC_INTRCTRL_DCLPOCIE(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_INTRCTRL_DCLPOCIE_SHIFT)) & PMC_INTRCTRL_DCLPOCIE_MASK)

#define PMC_INTRCTRL_AGDET1IE_MASK               (0x10000U)
#define PMC_INTRCTRL_AGDET1IE_SHIFT              (16U)
/*! AGDET1IE - VDD1 Glitch Detector Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define PMC_INTRCTRL_AGDET1IE(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_INTRCTRL_AGDET1IE_SHIFT)) & PMC_INTRCTRL_AGDET1IE_MASK)

#define PMC_INTRCTRL_AGDET2IE_MASK               (0x20000U)
#define PMC_INTRCTRL_AGDET2IE_SHIFT              (17U)
/*! AGDET2IE - VDD2 Glitch Detector Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define PMC_INTRCTRL_AGDET2IE(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_INTRCTRL_AGDET2IE_SHIFT)) & PMC_INTRCTRL_AGDET2IE_MASK)

#define PMC_INTRCTRL_LVD1IE_MASK                 (0x40000U)
#define PMC_INTRCTRL_LVD1IE_SHIFT                (18U)
/*! LVD1IE - VDD1 Low-Voltage Detector Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define PMC_INTRCTRL_LVD1IE(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_INTRCTRL_LVD1IE_SHIFT)) & PMC_INTRCTRL_LVD1IE_MASK)

#define PMC_INTRCTRL_LVD2IE_MASK                 (0x80000U)
#define PMC_INTRCTRL_LVD2IE_SHIFT                (19U)
/*! LVD2IE - VDD2 Low-Voltage Detector Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define PMC_INTRCTRL_LVD2IE(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_INTRCTRL_LVD2IE_SHIFT)) & PMC_INTRCTRL_LVD2IE_MASK)

#define PMC_INTRCTRL_LVDNIE_MASK                 (0x100000U)
#define PMC_INTRCTRL_LVDNIE_SHIFT                (20U)
/*! LVDNIE - VDDN Low-Voltage Detector Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define PMC_INTRCTRL_LVDNIE(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_INTRCTRL_LVDNIE_SHIFT)) & PMC_INTRCTRL_LVDNIE_MASK)

#define PMC_INTRCTRL_HVD1IE_MASK                 (0x200000U)
#define PMC_INTRCTRL_HVD1IE_SHIFT                (21U)
/*! HVD1IE - VDD1 High-Voltage Detector Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define PMC_INTRCTRL_HVD1IE(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_INTRCTRL_HVD1IE_SHIFT)) & PMC_INTRCTRL_HVD1IE_MASK)

#define PMC_INTRCTRL_HVD2IE_MASK                 (0x400000U)
#define PMC_INTRCTRL_HVD2IE_SHIFT                (22U)
/*! HVD2IE - VDD2 High-Voltage Detector Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define PMC_INTRCTRL_HVD2IE(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_INTRCTRL_HVD2IE_SHIFT)) & PMC_INTRCTRL_HVD2IE_MASK)

#define PMC_INTRCTRL_HVDNIE_MASK                 (0x800000U)
#define PMC_INTRCTRL_HVDNIE_SHIFT                (23U)
/*! HVDNIE - VDDN High-Voltage Detector Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define PMC_INTRCTRL_HVDNIE(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_INTRCTRL_HVDNIE_SHIFT)) & PMC_INTRCTRL_HVDNIE_MASK)

#define PMC_INTRCTRL_HVD1V8IE_MASK               (0x1000000U)
#define PMC_INTRCTRL_HVD1V8IE_SHIFT              (24U)
/*! HVD1V8IE - VDD1V8 High-Voltage Detector Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define PMC_INTRCTRL_HVD1V8IE(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_INTRCTRL_HVD1V8IE_SHIFT)) & PMC_INTRCTRL_HVD1V8IE_MASK)

#define PMC_INTRCTRL_AUTOWKIE_MASK               (0x4000000U)
#define PMC_INTRCTRL_AUTOWKIE_SHIFT              (26U)
/*! AUTOWKIE - Auto Wake-up Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define PMC_INTRCTRL_AUTOWKIE(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_INTRCTRL_AUTOWKIE_SHIFT)) & PMC_INTRCTRL_AUTOWKIE_MASK)

#define PMC_INTRCTRL_INTNIE_MASK                 (0x8000000U)
#define PMC_INTRCTRL_INTNIE_SHIFT                (27U)
/*! INTNIE - PMIC_IRQN PAD Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define PMC_INTRCTRL_INTNIE(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_INTRCTRL_INTNIE_SHIFT)) & PMC_INTRCTRL_INTNIE_MASK)

#define PMC_INTRCTRL_DSCOMPIE_MASK               (0x40000000U)
#define PMC_INTRCTRL_DSCOMPIE_SHIFT              (30U)
/*! DSCOMPIE - CPU0 Deep Sleep Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define PMC_INTRCTRL_DSCOMPIE(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_INTRCTRL_DSCOMPIE_SHIFT)) & PMC_INTRCTRL_DSCOMPIE_MASK)
/*! @} */

/*! @name DCDCVSEL - DCDC Voltage Selection */
/*! @{ */

#define PMC_DCDCVSEL_VSEL0_MASK                  (0x7FU)
#define PMC_DCDCVSEL_VSEL0_SHIFT                 (0U)
/*! VSEL0 - DCDC Voltage Level 0
 *  0b0000000..0.50 V
 *  0b0100000..0.70 V
 *  0b1000000..0.90 V
 *  0b1100000..1.10 V
 *  0b1101000..1.15 V (maximum)
 *  0b1111111..1.15 V (clipped)
 */
#define PMC_DCDCVSEL_VSEL0(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_DCDCVSEL_VSEL0_SHIFT)) & PMC_DCDCVSEL_VSEL0_MASK)

#define PMC_DCDCVSEL_VSEL1_MASK                  (0x7F00U)
#define PMC_DCDCVSEL_VSEL1_SHIFT                 (8U)
/*! VSEL1 - DCDC Voltage Level 1
 *  0b0000000..0.50 V
 *  0b0100000..0.70 V
 *  0b1000000..0.90 V
 *  0b1100000..1.10 V
 *  0b1101000..1.15 V (maximum)
 *  0b1111111..1.15 V (clipped)
 */
#define PMC_DCDCVSEL_VSEL1(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_DCDCVSEL_VSEL1_SHIFT)) & PMC_DCDCVSEL_VSEL1_MASK)
/*! @} */

/*! @name LDOVDD2VSEL - LDO VDD2 Voltage Selection */
/*! @{ */

#define PMC_LDOVDD2VSEL_VSEL0_MASK               (0x3FU)
#define PMC_LDOVDD2VSEL_VSEL0_SHIFT              (0U)
/*! VSEL0 - LDO VDD2 Voltage Level 0
 *  0b000000..0.45 V
 *  0b010000..0.65 V
 *  0b100000..0.85 V
 *  0b110000..1.05 V
 *  0b111000..1.15 V (maximum)
 *  0b111111..1.15 V (clipped)
 */
#define PMC_LDOVDD2VSEL_VSEL0(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_LDOVDD2VSEL_VSEL0_SHIFT)) & PMC_LDOVDD2VSEL_VSEL0_MASK)

#define PMC_LDOVDD2VSEL_VSEL1_MASK               (0x3F00U)
#define PMC_LDOVDD2VSEL_VSEL1_SHIFT              (8U)
/*! VSEL1 - LDO VDD2 Voltage Level 1
 *  0b000000..0.45 V
 *  0b010000..0.65 V
 *  0b100000..0.85 V
 *  0b110000..1.05 V
 *  0b111000..1.15 V (maximum)
 *  0b111111..1.15 V (clipped)
 */
#define PMC_LDOVDD2VSEL_VSEL1(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_LDOVDD2VSEL_VSEL1_SHIFT)) & PMC_LDOVDD2VSEL_VSEL1_MASK)

