nxp-mcuxpresso/mcux-sdk/devices/MIMXRT758S/MIMXRT758S_hifi1.h
#define PMC_PORCTRL_VDDNLVL_MASK                 (0x1F0000U)
#define PMC_PORCTRL_VDDNLVL_SHIFT                (16U)
/*! VDDNLVL - POR Level in VDDN Domain
 *  0b00000..0.40 V
 *  0b01000..0.48 V
 *  0b10000..0.56 V
 *  0b11000..0.64 V
 *  0b11111..0.72 V
 */
#define PMC_PORCTRL_VDDNLVL(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PORCTRL_VDDNLVL_SHIFT)) & PMC_PORCTRL_VDDNLVL_MASK)
/*! @} */

/*! @name BBCTRL - Body Bias Control */
/*! @{ */

#define PMC_BBCTRL_RBB1LVL_MASK                  (0x1U)
#define PMC_BBCTRL_RBB1LVL_SHIFT                 (0U)
/*! RBB1LVL - Reverse Body Bias Voltage for VDD1 Domain
 *  0b1..Voltage is set to 1.3 V
 *  0b0..Voltage is set to 1.0 V
 */
#define PMC_BBCTRL_RBB1LVL(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_BBCTRL_RBB1LVL_SHIFT)) & PMC_BBCTRL_RBB1LVL_MASK)

#define PMC_BBCTRL_RBB2LVL_MASK                  (0x100U)
#define PMC_BBCTRL_RBB2LVL_SHIFT                 (8U)
/*! RBB2LVL - Reverse Body Bias Voltage for VDD2 Domain
 *  0b1..Voltage is set to 1.3 V
 *  0b0..Voltage is set to 1.0 V
 */
#define PMC_BBCTRL_RBB2LVL(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_BBCTRL_RBB2LVL_SHIFT)) & PMC_BBCTRL_RBB2LVL_MASK)

#define PMC_BBCTRL_RBBNLVL_MASK                  (0x10000U)
#define PMC_BBCTRL_RBBNLVL_SHIFT                 (16U)
/*! RBBNLVL - Reverse Body Bias Voltage for VDDN Domain
 *  0b0..Voltage is set to 1.0 V
 *  0b1..Voltage is set to 1.3 V
 */
#define PMC_BBCTRL_RBBNLVL(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_BBCTRL_RBBNLVL_SHIFT)) & PMC_BBCTRL_RBBNLVL_MASK)
/*! @} */

/*! @name TSENSOR - Temperature Sensor Control */
/*! @{ */

#define PMC_TSENSOR_TSENSM_MASK                  (0xFU)
#define PMC_TSENSOR_TSENSM_SHIFT                 (0U)
/*! TSENSM - Temperature Sensor Mode Select
 *  0b0000..Perform AD conversion and record C*_000
 *  0b0001..Perform AD conversion and record C*_001
 *  0b0010..Perform AD conversion and record C*_010
 *  0b0011..Perform AD conversion and record C*_011
 *  0b0100..Perform AD conversion and record CM_100
 *  0b0101..Perform AD conversion and record C*_101
 *  0b0110..Perform AD conversion and record C*_110
 *  0b0111..Perform AD conversion and record C*_111
 */
#define PMC_TSENSOR_TSENSM(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_TSENSOR_TSENSM_SHIFT)) & PMC_TSENSOR_TSENSM_MASK)
/*! @} */

/*! @name WAKEUP - Wake-up Configuration for Sense Domain */
/*! @{ */

#define PMC_WAKEUP_WAKETIME_MASK                 (0xFFFFU)
#define PMC_WAKEUP_WAKETIME_SHIFT                (0U)
/*! WAKETIME - Wake-up Timer */
#define PMC_WAKEUP_WAKETIME(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_WAKEUP_WAKETIME_SHIFT)) & PMC_WAKEUP_WAKETIME_MASK)
/*! @} */

/*! @name POWERCFG - Power Configuration */
/*! @{ */

#define PMC_POWERCFG_FDSCP1PD_MASK               (0x1U)
#define PMC_POWERCFG_FDSCP1PD_SHIFT              (0U)
/*! FDSCP1PD - SCPC VDD1 Power Down in FDSR Mode
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_POWERCFG_FDSCP1PD(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_POWERCFG_FDSCP1PD_SHIFT)) & PMC_POWERCFG_FDSCP1PD_MASK)

#define PMC_POWERCFG_FDSCP2PD_MASK               (0x2U)
#define PMC_POWERCFG_FDSCP2PD_SHIFT              (1U)
/*! FDSCP2PD - SCPC VDD2 Power Down in FDSR Mode
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_POWERCFG_FDSCP2PD(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_POWERCFG_FDSCP2PD_SHIFT)) & PMC_POWERCFG_FDSCP2PD_MASK)

#define PMC_POWERCFG_FDLDO1PD_MASK               (0x10U)
#define PMC_POWERCFG_FDLDO1PD_SHIFT              (4U)
/*! FDLDO1PD - LDO VDD1 Power Down in FDSR Mode
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_POWERCFG_FDLDO1PD(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_POWERCFG_FDLDO1PD_SHIFT)) & PMC_POWERCFG_FDLDO1PD_MASK)

#define PMC_POWERCFG_FDLDO2PD_MASK               (0x20U)
#define PMC_POWERCFG_FDLDO2PD_SHIFT              (5U)
/*! FDLDO2PD - LDO VDD2 Power Down in FDSR Mode
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_POWERCFG_FDLDO2PD(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_POWERCFG_FDLDO2PD_SHIFT)) & PMC_POWERCFG_FDLDO2PD_MASK)

#define PMC_POWERCFG_FDDCPD_MASK                 (0x40U)
#define PMC_POWERCFG_FDDCPD_SHIFT                (6U)
/*! FDDCPD - DCDC Power Down in FDSR Mode
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_POWERCFG_FDDCPD(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_POWERCFG_FDDCPD_SHIFT)) & PMC_POWERCFG_FDDCPD_MASK)

#define PMC_POWERCFG_SCPCPD_MASK                 (0x80U)
#define PMC_POWERCFG_SCPCPD_SHIFT                (7U)
/*! SCPCPD - SCPC Power Down
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_POWERCFG_SCPCPD(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_POWERCFG_SCPCPD_SHIFT)) & PMC_POWERCFG_SCPCPD_MASK)

#define PMC_POWERCFG_LDO1PD_MASK                 (0x100U)
#define PMC_POWERCFG_LDO1PD_SHIFT                (8U)
/*! LDO1PD - LDO VDD1 Power Down
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_POWERCFG_LDO1PD(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_POWERCFG_LDO1PD_SHIFT)) & PMC_POWERCFG_LDO1PD_MASK)

#define PMC_POWERCFG_LDO2PD_MASK                 (0x200U)
#define PMC_POWERCFG_LDO2PD_SHIFT                (9U)
/*! LDO2PD - LDO VDD2 Power Down
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_POWERCFG_LDO2PD(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_POWERCFG_LDO2PD_SHIFT)) & PMC_POWERCFG_LDO2PD_MASK)

#define PMC_POWERCFG_DCDCPD_MASK                 (0x1000U)
#define PMC_POWERCFG_DCDCPD_SHIFT                (12U)
/*! DCDCPD - DCDC Power Down
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_POWERCFG_DCDCPD(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_POWERCFG_DCDCPD_SHIFT)) & PMC_POWERCFG_DCDCPD_MASK)

#define PMC_POWERCFG_FDPDBGLP_MASK               (0x1000000U)
#define PMC_POWERCFG_FDPDBGLP_SHIFT              (24U)
/*! FDPDBGLP - Force Band Gap during FDPD Mode to LP Mode
 *  0b0..Enables band gap to high-power mode during FDPD mode and wakes up if VDD1V8 POR is asserted then negated
 *  0b1..Enables band gap to low-power mode during FDPD mode and will not wake up on VDD1V8 POR negation. RTC, INTR, or reset is used as wake-up
 */
#define PMC_POWERCFG_FDPDBGLP(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_POWERCFG_FDPDBGLP_SHIFT)) & PMC_POWERCFG_FDPDBGLP_MASK)

#define PMC_POWERCFG_MODEDLY_MASK                (0xF0000000U)
#define PMC_POWERCFG_MODEDLY_SHIFT               (28U)
/*! MODEDLY - Mode Delay
 *  0b0000..250 ns
 *  0b0001..500 ns
 *  0b0010..1000 ns
 *  0b0011..2000 ns
 *  0b0100..4000 ns
 *  0b0101..8000 ns
 *  0b0110..16 us
 *  0b0111..32 us
 *  0b1000..64 us
 *  0b1001..128 us
 *  0b1010..256 us
 *  0b1011..512 us
 *  0b1100..1024 us
 *  0b1101..2048 us
 *  0b1110..4096 us
 *  0b1111..8192 us
 */
#define PMC_POWERCFG_MODEDLY(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_POWERCFG_MODEDLY_SHIFT)) & PMC_POWERCFG_MODEDLY_MASK)
/*! @} */

/*! @name PADVRANGE - 3 V Capable VDDIO Range Select */
/*! @{ */

#define PMC_PADVRANGE_VRANGE_MASK                (0x3U)
#define PMC_PADVRANGE_VRANGE_SHIFT               (0U)
/*! VRANGE - 3 V Capable IO Bank VDDIO Range Select
 *  0b11..Reserved
 *  0b10..3.00 - 3.6 V, supply detector off
 *  0b01..1.71 - 1.98 V, supply detector off
 *  0b00..Continuous mode. Allows 1.71 - 3.6 V range but consumes static current.
 */
#define PMC_PADVRANGE_VRANGE(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PADVRANGE_VRANGE_SHIFT)) & PMC_PADVRANGE_VRANGE_MASK)
/*! @} */

/*! @name PADCFG - IO Bank State Configuration */
/*! @{ */

#define PMC_PADCFG_ISOCTRL_MASK                  (0xFFU)
#define PMC_PADCFG_ISOCTRL_SHIFT                 (0U)
/*! ISOCTRL - IO bank State Retain Control
 *  0bxxxxxxx1..Port 0/1/3 is in retain mode
 *  0bxxxxxx1x..Port 2 is in retain mode
 *  0bxxxxx1xx..Port 4 is in retain mode
 *  0bxxxx1xxx..Port 5 is in retain mode
 *  0bxxx1xxxx..Port 6 is in retain mode
 *  0bxx1xxxxx..Port 7 is in retain mode
 *  0bx1xxxxxx..Port 8/9/10 is in retain mode
 *  0b1xxxxxxx..PMIC_I2C is in retain mode
 *  0b00000000..IO bank is controllable
 */
#define PMC_PADCFG_ISOCTRL(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_PADCFG_ISOCTRL_SHIFT)) & PMC_PADCFG_ISOCTRL_MASK)

#define PMC_PADCFG_ISOHOLD_MASK                  (0xFF00U)
#define PMC_PADCFG_ISOHOLD_SHIFT                 (8U)
/*! ISOHOLD - IO Bank Isolation Hold
 *  0bxxxxxxx1..Port 0/1/3 is retained/isolated on wake-up from FDSR/DPD mode. Software must clear [ISOCTRL] bit 0 to regain control
 *  0bxxxxxx1x..Port 2 is retained/isolated on wake-up from FDSR/DPD mode. Software must clear [ISOCTRL] bit 1 to regain control
 *  0bxxxxx1xx..Port 4 is retained/isolated on wake-up from FDSR/DPD mode. Software must clear [ISOCTRL] bit 2 to regain control
 *  0bxxxx1xxx..Port 5 is retained/isolated on wake-up from FDSR/DPD mode. Software must clear [ISOCTRL] bit 3 to regain control
 *  0bxxx1xxxx..Port 6 is retained/isolated on wake-up from FDSR/DPD mode. Software must clear [ISOCTRL] bit 4 to regain control
 *  0bxx1xxxxx..Port 7 is retained/isolated on wake-up from FDSR/DPD mode. Software must clear [ISOCTRL] bit 5 to regain control
 *  0bx1xxxxxx..Port 8/9/10 is retained/isolated on wake-up from FDSR/DPD mode. Software must clear [ISOCTRL] bit 6 to regain control
 *  0b1xxxxxxx..PMIC_I2C is retained/isolated on wake-up from FDSR/DPD mode. Software must clear [ISOCTRL] bit 7 to regain control
 *  0b00000000..IO bank is controllable on wake-up from FDSR/DPD mode
 */
#define PMC_PADCFG_ISOHOLD(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_PADCFG_ISOHOLD_SHIFT)) & PMC_PADCFG_ISOHOLD_MASK)

#define PMC_PADCFG_RSTCTRL_MASK                  (0xFF0000U)
#define PMC_PADCFG_RSTCTRL_SHIFT                 (16U)
/*! RSTCTRL - Reset Control
 *  0bxxxxxxx1..Port 0/1/3 reset = tristate
 *  0bxxxxxx1x..Port 2 reset = tristate
 *  0bxxxxx1xx..Port 4 reset = tristate
 *  0bxxxx1xxx..Port 5 reset = tristate
 *  0bxxx1xxxx..Port 6 reset = tristate
 *  0bxx1xxxxx..Port 7 reset = tristate
 *  0bx1xxxxxx..Port 8/9/10 reset = tristate
 *  0b1xxxxxxx..PMIC_I2C reset = tristate
 *  0b00000000..IO banks are not reset
 */
#define PMC_PADCFG_RSTCTRL(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_PADCFG_RSTCTRL_SHIFT)) & PMC_PADCFG_RSTCTRL_MASK)
/*! @} */

/*! @name PDRUNCFG0 - PD Run Configuration 0 in Sense Domain */
/*! @{ */

#define PMC_PDRUNCFG0_PMICMODE_MASK              (0x3U)
#define PMC_PDRUNCFG0_PMICMODE_SHIFT             (0U)
/*! PMICMODE - PMIC Power Mode Select
 *  0b11..Drives PMIC_MODE pins to 3h
 *  0b10..Drives PMIC_MODE pins to 2h
 *  0b01..Drives PMIC_MODE pins to 1h
 *  0b00..Drives PMIC_MODE pins to 0h
 */
#define PMC_PDRUNCFG0_PMICMODE(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_PMICMODE_SHIFT)) & PMC_PDRUNCFG0_PMICMODE_MASK)

#define PMC_PDRUNCFG0_V2NMED_DSR_MASK            (0x40U)
#define PMC_PDRUNCFG0_V2NMED_DSR_SHIFT           (6U)
/*! V2NMED_DSR - Power Switch and DSR for VDD2 and VDDN Media
 *  0b1..Enables VDD2 and VDDN media domains in DSR mode
 *  0b0..Powers on VDD2 and VDDN media domains
 */
#define PMC_PDRUNCFG0_V2NMED_DSR(x)              (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_V2NMED_DSR_SHIFT)) & PMC_PDRUNCFG0_V2NMED_DSR_MASK)

#define PMC_PDRUNCFG0_VNCOM_DSR_MASK             (0x100U)
#define PMC_PDRUNCFG0_VNCOM_DSR_SHIFT            (8U)
/*! VNCOM_DSR - Power Switch and DSR for VDDN_COM
 *  0b1..Enables VDDN_COM domain in DSR mode
 *  0b0..Powers on VDDN_COM domain
 */
#define PMC_PDRUNCFG0_VNCOM_DSR(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_VNCOM_DSR_SHIFT)) & PMC_PDRUNCFG0_VNCOM_DSR_MASK)

#define PMC_PDRUNCFG0_V2DSP_PD_MASK              (0x200U)
#define PMC_PDRUNCFG0_V2DSP_PD_SHIFT             (9U)
/*! V2DSP_PD - Power Down VDD2_DSP
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDRUNCFG0_V2DSP_PD(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_V2DSP_PD_SHIFT)) & PMC_PDRUNCFG0_V2DSP_PD_MASK)

#define PMC_PDRUNCFG0_V2MIPI_PD_MASK             (0x400U)
#define PMC_PDRUNCFG0_V2MIPI_PD_SHIFT            (10U)
/*! V2MIPI_PD - Power Down MIPI PHY in VDD2 Domain
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDRUNCFG0_V2MIPI_PD(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_V2MIPI_PD_SHIFT)) & PMC_PDRUNCFG0_V2MIPI_PD_MASK)

#define PMC_PDRUNCFG0_DCDC_LP_MASK               (0x1000U)
#define PMC_PDRUNCFG0_DCDC_LP_SHIFT              (12U)
/*! DCDC_LP - DCDC Low-Power Mode
 *  0b1..Enables DCDC in low-power mode
 *  0b0..Enables DCDC in high-power mode
 */
#define PMC_PDRUNCFG0_DCDC_LP(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_DCDC_LP_SHIFT)) & PMC_PDRUNCFG0_DCDC_LP_MASK)

#define PMC_PDRUNCFG0_DCDC_VSEL_MASK             (0x2000U)
#define PMC_PDRUNCFG0_DCDC_VSEL_SHIFT            (13U)
/*! DCDC_VSEL - Select DCDC Voltage
 *  0b1..Selects DCDCVSEL[VSEL1] level
 *  0b0..Selects DCDCVSEL[VSEL0] level
 */
#define PMC_PDRUNCFG0_DCDC_VSEL(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_DCDC_VSEL_SHIFT)) & PMC_PDRUNCFG0_DCDC_VSEL_MASK)

#define PMC_PDRUNCFG0_LDO1_MODE_MASK             (0xC000U)
#define PMC_PDRUNCFG0_LDO1_MODE_SHIFT            (14U)
/*! LDO1_MODE - LDO VDD1 Mode
 *  0b10, 0b11..Low-power mode
 *  0b01..High-power mode
 *  0b00..Bypass mode
 */
#define PMC_PDRUNCFG0_LDO1_MODE(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_LDO1_MODE_SHIFT)) & PMC_PDRUNCFG0_LDO1_MODE_MASK)

#define PMC_PDRUNCFG0_LDO1_VSEL_MASK             (0x30000U)
#define PMC_PDRUNCFG0_LDO1_VSEL_SHIFT            (16U)
/*! LDO1_VSEL - LDO VDD1 Voltage Select
 *  0b00..Selects LDOVDD1VSEL[VSEL0] and LVDVDD1CTRL[LVL0] level
 *  0b01..Selects LDOVDD1VSEL[VSEL1] and LVDVDD1CTRL[LVL1] level
 *  0b10..Selects LDOVDD1VSEL[VSEL2] and LVDVDD1CTRL[LVL2] level
 *  0b11..Selects LDOVDD1VSEL[VSEL3] and LVDVDD1CTRL[LVL3] level
 */
#define PMC_PDRUNCFG0_LDO1_VSEL(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_LDO1_VSEL_SHIFT)) & PMC_PDRUNCFG0_LDO1_VSEL_MASK)

#define PMC_PDRUNCFG0_LDO2_MODE_MASK             (0xC0000U)
#define PMC_PDRUNCFG0_LDO2_MODE_SHIFT            (18U)
/*! LDO2_MODE - LDO VDD2 Mode
 *  0b10, 0b11..Low-power mode
 *  0b01..High-power mode
 *  0b00..Bypass mode
 */
#define PMC_PDRUNCFG0_LDO2_MODE(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_LDO2_MODE_SHIFT)) & PMC_PDRUNCFG0_LDO2_MODE_MASK)

#define PMC_PDRUNCFG0_LDO2_VSEL_MASK             (0x300000U)
#define PMC_PDRUNCFG0_LDO2_VSEL_SHIFT            (20U)
/*! LDO2_VSEL - Select LDO VDD2 Voltage
 *  0b00..Selects LDOVDD2VSEL[VSEL0] and LVDVDD2CTRL[LVL0] level
 *  0b01..Selects LDOVDD2VSEL[VSEL1] and LVDVDD2CTRL[LVL1] level
 *  0b10..Selects LDOVDD2VSEL[VSEL2] and LVDVDD2CTRL[LVL2] level
 *  0b11..Selects LDOVDD2VSEL[VSEL3] and LVDVDD2CTRL[LVL3] level
 */
#define PMC_PDRUNCFG0_LDO2_VSEL(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_LDO2_VSEL_SHIFT)) & PMC_PDRUNCFG0_LDO2_VSEL_MASK)

#define PMC_PDRUNCFG0_RBB1_PD_MASK               (0x400000U)
#define PMC_PDRUNCFG0_RBB1_PD_SHIFT              (22U)
/*! RBB1_PD - Power Down RBB in VDD1
 *  0b0..If PDRUNCFG0[AFBB1_PD] = 1, power on. Else power down
 *  0b1..Power down
 */
#define PMC_PDRUNCFG0_RBB1_PD(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_RBB1_PD_SHIFT)) & PMC_PDRUNCFG0_RBB1_PD_MASK)

#define PMC_PDRUNCFG0_AFBB1_PD_MASK              (0x800000U)
#define PMC_PDRUNCFG0_AFBB1_PD_SHIFT             (23U)
/*! AFBB1_PD - Power Down AFBB in VDD1 Domain
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDRUNCFG0_AFBB1_PD(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_AFBB1_PD_SHIFT)) & PMC_PDRUNCFG0_AFBB1_PD_MASK)

#define PMC_PDRUNCFG0_RBB2_PD_MASK               (0x1000000U)
#define PMC_PDRUNCFG0_RBB2_PD_SHIFT              (24U)
/*! RBB2_PD - Power Down RBB in VDD2 Domain
 *  0b1..Power down
 *  0b0..If PDRUNCFG0[AFBB2_PD] = 1, power on. Else power down
 */
#define PMC_PDRUNCFG0_RBB2_PD(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_RBB2_PD_SHIFT)) & PMC_PDRUNCFG0_RBB2_PD_MASK)

