nxp-mcuxpresso/mcux-sdk/devices/MIMXRT758S/MIMXRT758S_hifi1.h
#define PMC_PDRUNCFG5_EZH_TCM_MASK               (0x10000U)
#define PMC_PDRUNCFG5_EZH_TCM_SHIFT              (16U)
/*! EZH_TCM - EZH-V TCM
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDRUNCFG5_EZH_TCM(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG5_EZH_TCM_SHIFT)) & PMC_PDRUNCFG5_EZH_TCM_MASK)

#define PMC_PDRUNCFG5_NPU_MASK                   (0x20000U)
#define PMC_PDRUNCFG5_NPU_SHIFT                  (17U)
/*! NPU - NPU
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDRUNCFG5_NPU(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG5_NPU_SHIFT)) & PMC_PDRUNCFG5_NPU_MASK)

#define PMC_PDRUNCFG5_XSPI0_MASK                 (0x40000U)
#define PMC_PDRUNCFG5_XSPI0_SHIFT                (18U)
/*! XSPI0 - XSPI0, MMU0, and Cache
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDRUNCFG5_XSPI0(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG5_XSPI0_SHIFT)) & PMC_PDRUNCFG5_XSPI0_MASK)

#define PMC_PDRUNCFG5_XSPI1_MASK                 (0x80000U)
#define PMC_PDRUNCFG5_XSPI1_SHIFT                (19U)
/*! XSPI1 - XSPI1, MMU1, and Cache
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDRUNCFG5_XSPI1(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG5_XSPI1_SHIFT)) & PMC_PDRUNCFG5_XSPI1_MASK)

#define PMC_PDRUNCFG5_XSPI2_MASK                 (0x100000U)
#define PMC_PDRUNCFG5_XSPI2_SHIFT                (20U)
/*! XSPI2 - XSPI2 and MMU2
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDRUNCFG5_XSPI2(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG5_XSPI2_SHIFT)) & PMC_PDRUNCFG5_XSPI2_MASK)

#define PMC_PDRUNCFG5_LCD_MASK                   (0x200000U)
#define PMC_PDRUNCFG5_LCD_SHIFT                  (21U)
/*! LCD - LCDIF
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDRUNCFG5_LCD(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG5_LCD_SHIFT)) & PMC_PDRUNCFG5_LCD_MASK)

#define PMC_PDRUNCFG5_OCOTP_MASK                 (0x400000U)
#define PMC_PDRUNCFG5_OCOTP_SHIFT                (22U)
/*! OCOTP - OCOTP Shadow SRAM
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDRUNCFG5_OCOTP(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG5_OCOTP_SHIFT)) & PMC_PDRUNCFG5_OCOTP_MASK)
/*! @} */

/*! @name PDSLEEPCFG0 - PD Sleep Configuration 0 in Sense Domain */
/*! @{ */

#define PMC_PDSLEEPCFG0_PMICMODE_MASK            (0x3U)
#define PMC_PDSLEEPCFG0_PMICMODE_SHIFT           (0U)
/*! PMICMODE - PMIC Mode
 *  0b11..Drives PMIC_MODE pins to 3h
 *  0b10..Drives PMIC_MODE pins to 2h
 *  0b01..Drives PMIC_MODE pins to 1h
 *  0b00..Drives PMIC_MODE pins to 0h
 */
#define PMC_PDSLEEPCFG0_PMICMODE(x)              (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_PMICMODE_SHIFT)) & PMC_PDSLEEPCFG0_PMICMODE_MASK)

#define PMC_PDSLEEPCFG0_FDSR_MASK                (0x4U)
#define PMC_PDSLEEPCFG0_FDSR_SHIFT               (2U)
/*! FDSR - Full Deep Sleep Retention (FDSR) Mode
 *  0b1..All core domains in DSR or Power Down mode
 *  0b0..All power switch states controlled by their respective PD*CFG bits
 */
#define PMC_PDSLEEPCFG0_FDSR(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_FDSR_SHIFT)) & PMC_PDSLEEPCFG0_FDSR_MASK)

#define PMC_PDSLEEPCFG0_DPD_MASK                 (0x8U)
#define PMC_PDSLEEPCFG0_DPD_SHIFT                (3U)
/*! DPD - Deep Power Down (DPD) Mode
 *  0b1..Enables DPD mode
 *  0b0..Disables
 */
#define PMC_PDSLEEPCFG0_DPD(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_DPD_SHIFT)) & PMC_PDSLEEPCFG0_DPD_MASK)

#define PMC_PDSLEEPCFG0_FDPD_MASK                (0x10U)
#define PMC_PDSLEEPCFG0_FDPD_SHIFT               (4U)
/*! FDPD - Full Deep Power Down (FDPD) Mode
 *  0b1..Enables FDPD mode
 *  0b0..Disables
 */
#define PMC_PDSLEEPCFG0_FDPD(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_FDPD_SHIFT)) & PMC_PDSLEEPCFG0_FDPD_MASK)

#define PMC_PDSLEEPCFG0_V2COMP_DSR_MASK          (0x20U)
#define PMC_PDSLEEPCFG0_V2COMP_DSR_SHIFT         (5U)
/*! V2COMP_DSR - Power Switch and DSR Enable in VDD2_COMP Domain
 *  0b1..DSR mode in VDD2_COMP enabled
 *  0b0..DSR mode in VDD2_COMP disabled
 */
#define PMC_PDSLEEPCFG0_V2COMP_DSR(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_V2COMP_DSR_SHIFT)) & PMC_PDSLEEPCFG0_V2COMP_DSR_MASK)

#define PMC_PDSLEEPCFG0_V2NMED_DSR_MASK          (0x40U)
#define PMC_PDSLEEPCFG0_V2NMED_DSR_SHIFT         (6U)
/*! V2NMED_DSR - Power Switch and DSR Enable in VDD2_MEDIA and VDDN_MEDIA Domains
 *  0b1..Enables DSR mode in VDD2_MEDIA and VDDN_MEDIA
 *  0b0..Powers on VDD2_MEDIA and VDDN_MEDIA
 */
#define PMC_PDSLEEPCFG0_V2NMED_DSR(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_V2NMED_DSR_SHIFT)) & PMC_PDSLEEPCFG0_V2NMED_DSR_MASK)

#define PMC_PDSLEEPCFG0_V2COM_DSR_MASK           (0x80U)
#define PMC_PDSLEEPCFG0_V2COM_DSR_SHIFT          (7U)
/*! V2COM_DSR - Power Switch and DSR Enable in VDD2_COM Domain
 *  0b1..Enables DSR mode in VDD2_COM
 *  0b0..Powers on VDD2_COM
 */
#define PMC_PDSLEEPCFG0_V2COM_DSR(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_V2COM_DSR_SHIFT)) & PMC_PDSLEEPCFG0_V2COM_DSR_MASK)

#define PMC_PDSLEEPCFG0_VNCOM_DSR_MASK           (0x100U)
#define PMC_PDSLEEPCFG0_VNCOM_DSR_SHIFT          (8U)
/*! VNCOM_DSR - Power Switch and DSR Enable in VDDN_COM Domain
 *  0b1..Enables DSR mode in VDDN_COM
 *  0b0..Powers on VDDN_COM
 */
#define PMC_PDSLEEPCFG0_VNCOM_DSR(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_VNCOM_DSR_SHIFT)) & PMC_PDSLEEPCFG0_VNCOM_DSR_MASK)

#define PMC_PDSLEEPCFG0_V2DSP_PD_MASK            (0x200U)
#define PMC_PDSLEEPCFG0_V2DSP_PD_SHIFT           (9U)
/*! V2DSP_PD - Power Down VDD2_DSP
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG0_V2DSP_PD(x)              (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_V2DSP_PD_SHIFT)) & PMC_PDSLEEPCFG0_V2DSP_PD_MASK)

#define PMC_PDSLEEPCFG0_V2MIPI_PD_MASK           (0x400U)
#define PMC_PDSLEEPCFG0_V2MIPI_PD_SHIFT          (10U)
/*! V2MIPI_PD - Power Down MIPI PHY in VDD2 Domain
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDSLEEPCFG0_V2MIPI_PD(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_V2MIPI_PD_SHIFT)) & PMC_PDSLEEPCFG0_V2MIPI_PD_MASK)

#define PMC_PDSLEEPCFG0_DCDC_LP_MASK             (0x1000U)
#define PMC_PDSLEEPCFG0_DCDC_LP_SHIFT            (12U)
/*! DCDC_LP - DCDC Low Power
 *  0b1..Sets DCDC in low-power mode
 *  0b0..Sets DCDC in high-power mode
 */
#define PMC_PDSLEEPCFG0_DCDC_LP(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_DCDC_LP_SHIFT)) & PMC_PDSLEEPCFG0_DCDC_LP_MASK)

