nxp-mcuxpresso/mcux-sdk/devices/MIMXRT758S/MIMXRT758S_hifi1.h
#define SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM20_F_LPACCEPT_MASK (0x80000U)
#define SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM20_F_LPACCEPT_SHIFT (19U)
/*! LP_FLEXCOMM20_F_LPACCEPT - LP_FLEXCOMM20 Function Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM20_F_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM20_F_LPACCEPT_SHIFT)) & SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM20_F_LPACCEPT_MASK)
/*! @} */

/*! @name LP_HINT0 - Low-Power Hint Status 0 */
/*! @{ */

#define SLEEPCON1_LP_HINT0_LP_FLEXCOMM17_B_LPHINT_MASK (0x1U)
#define SLEEPCON1_LP_HINT0_LP_FLEXCOMM17_B_LPHINT_SHIFT (0U)
/*! LP_FLEXCOMM17_B_LPHINT - LP_FLEXCOMM17 Bus Hint Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON1_LP_HINT0_LP_FLEXCOMM17_B_LPHINT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_LP_HINT0_LP_FLEXCOMM17_B_LPHINT_SHIFT)) & SLEEPCON1_LP_HINT0_LP_FLEXCOMM17_B_LPHINT_MASK)

#define SLEEPCON1_LP_HINT0_LP_FLEXCOMM18_B_LPHINT_MASK (0x2U)
#define SLEEPCON1_LP_HINT0_LP_FLEXCOMM18_B_LPHINT_SHIFT (1U)
/*! LP_FLEXCOMM18_B_LPHINT - LP_FLEXCOMM18 Bus Hint Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON1_LP_HINT0_LP_FLEXCOMM18_B_LPHINT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_LP_HINT0_LP_FLEXCOMM18_B_LPHINT_SHIFT)) & SLEEPCON1_LP_HINT0_LP_FLEXCOMM18_B_LPHINT_MASK)

#define SLEEPCON1_LP_HINT0_LP_FLEXCOMM19_B_LPHINT_MASK (0x4U)
#define SLEEPCON1_LP_HINT0_LP_FLEXCOMM19_B_LPHINT_SHIFT (2U)
/*! LP_FLEXCOMM19_B_LPHINT - LP_FLEXCOMM19 Bus Hint Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON1_LP_HINT0_LP_FLEXCOMM19_B_LPHINT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_LP_HINT0_LP_FLEXCOMM19_B_LPHINT_SHIFT)) & SLEEPCON1_LP_HINT0_LP_FLEXCOMM19_B_LPHINT_MASK)

#define SLEEPCON1_LP_HINT0_LP_FLEXCOMM20_B_LPHINT_MASK (0x8U)
#define SLEEPCON1_LP_HINT0_LP_FLEXCOMM20_B_LPHINT_SHIFT (3U)
/*! LP_FLEXCOMM20_B_LPHINT - LP_FLEXCOMM20 Bus Hint Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON1_LP_HINT0_LP_FLEXCOMM20_B_LPHINT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_LP_HINT0_LP_FLEXCOMM20_B_LPHINT_SHIFT)) & SLEEPCON1_LP_HINT0_LP_FLEXCOMM20_B_LPHINT_MASK)

#define SLEEPCON1_LP_HINT0_SAI3_B_LPHINT_MASK    (0x10U)
#define SLEEPCON1_LP_HINT0_SAI3_B_LPHINT_SHIFT   (4U)
/*! SAI3_B_LPHINT - SAI3 Bus Hint Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON1_LP_HINT0_SAI3_B_LPHINT(x)      (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_LP_HINT0_SAI3_B_LPHINT_SHIFT)) & SLEEPCON1_LP_HINT0_SAI3_B_LPHINT_MASK)

#define SLEEPCON1_LP_HINT0_GPIO8_LPHINT_MASK     (0x20U)
#define SLEEPCON1_LP_HINT0_GPIO8_LPHINT_SHIFT    (5U)
/*! GPIO8_LPHINT - GPIO8 Hint Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON1_LP_HINT0_GPIO8_LPHINT(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_LP_HINT0_GPIO8_LPHINT_SHIFT)) & SLEEPCON1_LP_HINT0_GPIO8_LPHINT_MASK)

#define SLEEPCON1_LP_HINT0_GPIO9_LPHINT_MASK     (0x40U)
#define SLEEPCON1_LP_HINT0_GPIO9_LPHINT_SHIFT    (6U)
/*! GPIO9_LPHINT - GPIO9 Hint Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON1_LP_HINT0_GPIO9_LPHINT(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_LP_HINT0_GPIO9_LPHINT_SHIFT)) & SLEEPCON1_LP_HINT0_GPIO9_LPHINT_MASK)

#define SLEEPCON1_LP_HINT0_GPIO10_LPHINT_MASK    (0x80U)
#define SLEEPCON1_LP_HINT0_GPIO10_LPHINT_SHIFT   (7U)
/*! GPIO10_LPHINT - GPIO10 Hint Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON1_LP_HINT0_GPIO10_LPHINT(x)      (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_LP_HINT0_GPIO10_LPHINT_SHIFT)) & SLEEPCON1_LP_HINT0_GPIO10_LPHINT_MASK)

#define SLEEPCON1_LP_HINT0_LPI2C15_B_LPHINT_MASK (0x100U)
#define SLEEPCON1_LP_HINT0_LPI2C15_B_LPHINT_SHIFT (8U)
/*! LPI2C15_B_LPHINT - LPI2C15 Bus Hint Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON1_LP_HINT0_LPI2C15_B_LPHINT(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_LP_HINT0_LPI2C15_B_LPHINT_SHIFT)) & SLEEPCON1_LP_HINT0_LPI2C15_B_LPHINT_MASK)

#define SLEEPCON1_LP_HINT0_LPSPI14_B_LPHINT_MASK (0x200U)
#define SLEEPCON1_LP_HINT0_LPSPI14_B_LPHINT_SHIFT (9U)
/*! LPSPI14_B_LPHINT - LPSPI14 Bus Hint Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON1_LP_HINT0_LPSPI14_B_LPHINT(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_LP_HINT0_LPSPI14_B_LPHINT_SHIFT)) & SLEEPCON1_LP_HINT0_LPSPI14_B_LPHINT_MASK)

#define SLEEPCON1_LP_HINT0_LPSPI16_B_LPHINT_MASK (0x400U)
#define SLEEPCON1_LP_HINT0_LPSPI16_B_LPHINT_SHIFT (10U)
/*! LPSPI16_B_LPHINT - LPSPI16 Bus Hint Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON1_LP_HINT0_LPSPI16_B_LPHINT(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_LP_HINT0_LPSPI16_B_LPHINT_SHIFT)) & SLEEPCON1_LP_HINT0_LPSPI16_B_LPHINT_MASK)

#define SLEEPCON1_LP_HINT0_FLEXIO_B_LPHINT_MASK  (0x800U)
#define SLEEPCON1_LP_HINT0_FLEXIO_B_LPHINT_SHIFT (11U)
/*! FLEXIO_B_LPHINT - FLEXIO Bus Hint Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON1_LP_HINT0_FLEXIO_B_LPHINT(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_LP_HINT0_FLEXIO_B_LPHINT_SHIFT)) & SLEEPCON1_LP_HINT0_FLEXIO_B_LPHINT_MASK)

#define SLEEPCON1_LP_HINT0_LP_FLEXCOMM17_F_LPHINT_MASK (0x10000U)
#define SLEEPCON1_LP_HINT0_LP_FLEXCOMM17_F_LPHINT_SHIFT (16U)
/*! LP_FLEXCOMM17_F_LPHINT - LP_FLEXCOMM17 Function Hint Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON1_LP_HINT0_LP_FLEXCOMM17_F_LPHINT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_LP_HINT0_LP_FLEXCOMM17_F_LPHINT_SHIFT)) & SLEEPCON1_LP_HINT0_LP_FLEXCOMM17_F_LPHINT_MASK)

#define SLEEPCON1_LP_HINT0_LP_FLEXCOMM18_F_LPHINT_MASK (0x20000U)
#define SLEEPCON1_LP_HINT0_LP_FLEXCOMM18_F_LPHINT_SHIFT (17U)
/*! LP_FLEXCOMM18_F_LPHINT - LP_FLEXCOMM18 Function Hint Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON1_LP_HINT0_LP_FLEXCOMM18_F_LPHINT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_LP_HINT0_LP_FLEXCOMM18_F_LPHINT_SHIFT)) & SLEEPCON1_LP_HINT0_LP_FLEXCOMM18_F_LPHINT_MASK)

#define SLEEPCON1_LP_HINT0_LP_FLEXCOMM19_F_LPHINT_MASK (0x40000U)
#define SLEEPCON1_LP_HINT0_LP_FLEXCOMM19_F_LPHINT_SHIFT (18U)
/*! LP_FLEXCOMM19_F_LPHINT - LP_FLEXCOMM19 Function Hint Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON1_LP_HINT0_LP_FLEXCOMM19_F_LPHINT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_LP_HINT0_LP_FLEXCOMM19_F_LPHINT_SHIFT)) & SLEEPCON1_LP_HINT0_LP_FLEXCOMM19_F_LPHINT_MASK)

#define SLEEPCON1_LP_HINT0_LP_FLEXCOMM20_F_LPHINT_MASK (0x80000U)
#define SLEEPCON1_LP_HINT0_LP_FLEXCOMM20_F_LPHINT_SHIFT (19U)
/*! LP_FLEXCOMM20_F_LPHINT - LP_FLEXCOMM20 Function Hint Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define SLEEPCON1_LP_HINT0_LP_FLEXCOMM20_F_LPHINT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_LP_HINT0_LP_FLEXCOMM20_F_LPHINT_SHIFT)) & SLEEPCON1_LP_HINT0_LP_FLEXCOMM20_F_LPHINT_MASK)

