nxp-mcuxpresso/mcux-sdk/devices/MIMXRT758S/MIMXRT758S_hifi1.h
#define SYSCON1_EDMA3_EN0_XSPI2_TX_EN_MASK       (0x8U)
#define SYSCON1_EDMA3_EN0_XSPI2_TX_EN_SHIFT      (3U)
/*! XSPI2_TX_EN - XSPI2 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN0_XSPI2_TX_EN(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN0_XSPI2_TX_EN_SHIFT)) & SYSCON1_EDMA3_EN0_XSPI2_TX_EN_MASK)

#define SYSCON1_EDMA3_EN0_PINT1_IRQ0_EN_MASK     (0x10U)
#define SYSCON1_EDMA3_EN0_PINT1_IRQ0_EN_SHIFT    (4U)
/*! PINT1_IRQ0_EN - PINT1 Interrupt 0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN0_PINT1_IRQ0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN0_PINT1_IRQ0_EN_SHIFT)) & SYSCON1_EDMA3_EN0_PINT1_IRQ0_EN_MASK)

#define SYSCON1_EDMA3_EN0_PINT1_IRQ1_EN_MASK     (0x20U)
#define SYSCON1_EDMA3_EN0_PINT1_IRQ1_EN_SHIFT    (5U)
/*! PINT1_IRQ1_EN - PINT1 Interrupt 1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN0_PINT1_IRQ1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN0_PINT1_IRQ1_EN_SHIFT)) & SYSCON1_EDMA3_EN0_PINT1_IRQ1_EN_MASK)

#define SYSCON1_EDMA3_EN0_PINT1_IRQ2_EN_MASK     (0x40U)
#define SYSCON1_EDMA3_EN0_PINT1_IRQ2_EN_SHIFT    (6U)
/*! PINT1_IRQ2_EN - PINT1 Interrupt 2 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN0_PINT1_IRQ2_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN0_PINT1_IRQ2_EN_SHIFT)) & SYSCON1_EDMA3_EN0_PINT1_IRQ2_EN_MASK)

#define SYSCON1_EDMA3_EN0_PINT1_IRQ3_EN_MASK     (0x80U)
#define SYSCON1_EDMA3_EN0_PINT1_IRQ3_EN_SHIFT    (7U)
/*! PINT1_IRQ3_EN - PINT1 Interrupt 3 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN0_PINT1_IRQ3_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN0_PINT1_IRQ3_EN_SHIFT)) & SYSCON1_EDMA3_EN0_PINT1_IRQ3_EN_MASK)

#define SYSCON1_EDMA3_EN0_CTIMER5_M0_EN_MASK     (0x100U)
#define SYSCON1_EDMA3_EN0_CTIMER5_M0_EN_SHIFT    (8U)
/*! CTIMER5_M0_EN - CTIMER5 M0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN0_CTIMER5_M0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN0_CTIMER5_M0_EN_SHIFT)) & SYSCON1_EDMA3_EN0_CTIMER5_M0_EN_MASK)

#define SYSCON1_EDMA3_EN0_CTIMER5_M1_EN_MASK     (0x200U)
#define SYSCON1_EDMA3_EN0_CTIMER5_M1_EN_SHIFT    (9U)
/*! CTIMER5_M1_EN - CTIMER5 M1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN0_CTIMER5_M1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN0_CTIMER5_M1_EN_SHIFT)) & SYSCON1_EDMA3_EN0_CTIMER5_M1_EN_MASK)

#define SYSCON1_EDMA3_EN0_CTIMER6_M0_EN_MASK     (0x400U)
#define SYSCON1_EDMA3_EN0_CTIMER6_M0_EN_SHIFT    (10U)
/*! CTIMER6_M0_EN - CTIMER6 M0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN0_CTIMER6_M0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN0_CTIMER6_M0_EN_SHIFT)) & SYSCON1_EDMA3_EN0_CTIMER6_M0_EN_MASK)

#define SYSCON1_EDMA3_EN0_CTIMER6_M1_EN_MASK     (0x800U)
#define SYSCON1_EDMA3_EN0_CTIMER6_M1_EN_SHIFT    (11U)
/*! CTIMER6_M1_EN - CTIMER6 M1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN0_CTIMER6_M1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN0_CTIMER6_M1_EN_SHIFT)) & SYSCON1_EDMA3_EN0_CTIMER6_M1_EN_MASK)

#define SYSCON1_EDMA3_EN0_CTIMER7_M0_EN_MASK     (0x1000U)
#define SYSCON1_EDMA3_EN0_CTIMER7_M0_EN_SHIFT    (12U)
/*! CTIMER7_M0_EN - CTIMER7 M0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN0_CTIMER7_M0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN0_CTIMER7_M0_EN_SHIFT)) & SYSCON1_EDMA3_EN0_CTIMER7_M0_EN_MASK)

#define SYSCON1_EDMA3_EN0_CTIMER7_M1_EN_MASK     (0x2000U)
#define SYSCON1_EDMA3_EN0_CTIMER7_M1_EN_SHIFT    (13U)
/*! CTIMER7_M1_EN - CTIMER7 M1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN0_CTIMER7_M1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN0_CTIMER7_M1_EN_SHIFT)) & SYSCON1_EDMA3_EN0_CTIMER7_M1_EN_MASK)

#define SYSCON1_EDMA3_EN0_ADC0_FIFO0_EN_MASK     (0x4000U)
#define SYSCON1_EDMA3_EN0_ADC0_FIFO0_EN_SHIFT    (14U)
/*! ADC0_FIFO0_EN - ADC0 FIFO0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN0_ADC0_FIFO0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN0_ADC0_FIFO0_EN_SHIFT)) & SYSCON1_EDMA3_EN0_ADC0_FIFO0_EN_MASK)

#define SYSCON1_EDMA3_EN0_ADC0_FIFO1_EN_MASK     (0x8000U)
#define SYSCON1_EDMA3_EN0_ADC0_FIFO1_EN_SHIFT    (15U)
/*! ADC0_FIFO1_EN - ADC0 FIFO1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN0_ADC0_FIFO1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN0_ADC0_FIFO1_EN_SHIFT)) & SYSCON1_EDMA3_EN0_ADC0_FIFO1_EN_MASK)

#define SYSCON1_EDMA3_EN0_SDADC_FIFO0_EN_MASK    (0x10000U)
#define SYSCON1_EDMA3_EN0_SDADC_FIFO0_EN_SHIFT   (16U)
/*! SDADC_FIFO0_EN - SDADC FIFO0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN0_SDADC_FIFO0_EN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN0_SDADC_FIFO0_EN_SHIFT)) & SYSCON1_EDMA3_EN0_SDADC_FIFO0_EN_MASK)

#define SYSCON1_EDMA3_EN0_SDADC_FIFO1_EN_MASK    (0x20000U)
#define SYSCON1_EDMA3_EN0_SDADC_FIFO1_EN_SHIFT   (17U)
/*! SDADC_FIFO1_EN - SDADC FIFO1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN0_SDADC_FIFO1_EN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN0_SDADC_FIFO1_EN_SHIFT)) & SYSCON1_EDMA3_EN0_SDADC_FIFO1_EN_MASK)

#define SYSCON1_EDMA3_EN0_SDADC_FIFO2_EN_MASK    (0x40000U)
#define SYSCON1_EDMA3_EN0_SDADC_FIFO2_EN_SHIFT   (18U)
/*! SDADC_FIFO2_EN - SDADC FIFO2 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN0_SDADC_FIFO2_EN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN0_SDADC_FIFO2_EN_SHIFT)) & SYSCON1_EDMA3_EN0_SDADC_FIFO2_EN_MASK)

#define SYSCON1_EDMA3_EN0_SDADC_FIFO3_EN_MASK    (0x80000U)
#define SYSCON1_EDMA3_EN0_SDADC_FIFO3_EN_SHIFT   (19U)
/*! SDADC_FIFO3_EN - SDADC FIFO3 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN0_SDADC_FIFO3_EN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN0_SDADC_FIFO3_EN_SHIFT)) & SYSCON1_EDMA3_EN0_SDADC_FIFO3_EN_MASK)

