nxp-mcuxpresso/mcux-sdk/devices/MIMXRT758S/MIMXRT758S_hifi1.h
#define SYSCON4_PNGDEC_MEM_CTRL_MEM_IG_MASK      (0x400U)
#define SYSCON4_PNGDEC_MEM_CTRL_MEM_IG_SHIFT     (10U)
/*! MEM_IG - Memory Input Gating
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON4_PNGDEC_MEM_CTRL_MEM_IG(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON4_PNGDEC_MEM_CTRL_MEM_IG_SHIFT)) & SYSCON4_PNGDEC_MEM_CTRL_MEM_IG_MASK)
/*! @} */

/*! @name MIPI_MEM_CTRL - MIPI Memory Control */
/*! @{ */

#define SYSCON4_MIPI_MEM_CTRL_MEM_STDBY_MASK     (0x80U)
#define SYSCON4_MIPI_MEM_CTRL_MEM_STDBY_SHIFT    (7U)
/*! MEM_STDBY - Memory Standby Mode
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON4_MIPI_MEM_CTRL_MEM_STDBY(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON4_MIPI_MEM_CTRL_MEM_STDBY_SHIFT)) & SYSCON4_MIPI_MEM_CTRL_MEM_STDBY_MASK)

#define SYSCON4_MIPI_MEM_CTRL_MEM_WIG_MASK       (0x100U)
#define SYSCON4_MIPI_MEM_CTRL_MEM_WIG_SHIFT      (8U)
/*! MEM_WIG - Memory Write Input Gating
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON4_MIPI_MEM_CTRL_MEM_WIG(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON4_MIPI_MEM_CTRL_MEM_WIG_SHIFT)) & SYSCON4_MIPI_MEM_CTRL_MEM_WIG_MASK)

#define SYSCON4_MIPI_MEM_CTRL_MEM_RIG_MASK       (0x200U)
#define SYSCON4_MIPI_MEM_CTRL_MEM_RIG_SHIFT      (9U)
/*! MEM_RIG - Memory Read Input Gating
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON4_MIPI_MEM_CTRL_MEM_RIG(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON4_MIPI_MEM_CTRL_MEM_RIG_SHIFT)) & SYSCON4_MIPI_MEM_CTRL_MEM_RIG_MASK)
/*! @} */

/*! @name VGPU_MEM_CTRL - VGPU Memory Control */
/*! @{ */

#define SYSCON4_VGPU_MEM_CTRL_MEM_STDBY_MASK     (0x80U)
#define SYSCON4_VGPU_MEM_CTRL_MEM_STDBY_SHIFT    (7U)
/*! MEM_STDBY - Memory Standby Mode
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON4_VGPU_MEM_CTRL_MEM_STDBY(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON4_VGPU_MEM_CTRL_MEM_STDBY_SHIFT)) & SYSCON4_VGPU_MEM_CTRL_MEM_STDBY_MASK)

#define SYSCON4_VGPU_MEM_CTRL_MEM_WIG_MASK       (0x100U)
#define SYSCON4_VGPU_MEM_CTRL_MEM_WIG_SHIFT      (8U)
/*! MEM_WIG - Memory Write Input Gating
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON4_VGPU_MEM_CTRL_MEM_WIG(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON4_VGPU_MEM_CTRL_MEM_WIG_SHIFT)) & SYSCON4_VGPU_MEM_CTRL_MEM_WIG_MASK)

#define SYSCON4_VGPU_MEM_CTRL_MEM_RIG_MASK       (0x200U)
#define SYSCON4_VGPU_MEM_CTRL_MEM_RIG_SHIFT      (9U)
/*! MEM_RIG - Memory Read Input Gating
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON4_VGPU_MEM_CTRL_MEM_RIG(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON4_VGPU_MEM_CTRL_MEM_RIG_SHIFT)) & SYSCON4_VGPU_MEM_CTRL_MEM_RIG_MASK)

#define SYSCON4_VGPU_MEM_CTRL_MEM_IG_MASK        (0x400U)
#define SYSCON4_VGPU_MEM_CTRL_MEM_IG_SHIFT       (10U)
/*! MEM_IG - Memory Input Gating
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON4_VGPU_MEM_CTRL_MEM_IG(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON4_VGPU_MEM_CTRL_MEM_IG_SHIFT)) & SYSCON4_VGPU_MEM_CTRL_MEM_IG_MASK)
/*! @} */

/*! @name EZHV_RSTBASE - EZH-V Reset Base */
/*! @{ */

#define SYSCON4_EZHV_RSTBASE_EZHV_RSTBASE_MASK   (0x3FFFFFFFU)
#define SYSCON4_EZHV_RSTBASE_EZHV_RSTBASE_SHIFT  (0U)
/*! EZHV_RSTBASE - Reset Exception Handler Base Address */
#define SYSCON4_EZHV_RSTBASE_EZHV_RSTBASE(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON4_EZHV_RSTBASE_EZHV_RSTBASE_SHIFT)) & SYSCON4_EZHV_RSTBASE_EZHV_RSTBASE_MASK)
/*! @} */

/*! @name EZHV_RSTMTVEC - EZH-V MTVEC Reset Value */
/*! @{ */

#define SYSCON4_EZHV_RSTMTVEC_EZHV_RSTMTVEC_MASK (0xFFFFFFFFU)
#define SYSCON4_EZHV_RSTMTVEC_EZHV_RSTMTVEC_SHIFT (0U)
/*! EZHV_RSTMTVEC - Reset Value of CSRs MTVEC */
#define SYSCON4_EZHV_RSTMTVEC_EZHV_RSTMTVEC(x)   (((uint32_t)(((uint32_t)(x)) << SYSCON4_EZHV_RSTMTVEC_EZHV_RSTMTVEC_SHIFT)) & SYSCON4_EZHV_RSTMTVEC_EZHV_RSTMTVEC_MASK)
/*! @} */

/*! @name EZHV_RSTSTVEC - EZH-V STVEC Reset Value */
/*! @{ */

#define SYSCON4_EZHV_RSTSTVEC_EZHV_RSTSTVEC_MASK (0xFFFFFFFFU)
#define SYSCON4_EZHV_RSTSTVEC_EZHV_RSTSTVEC_SHIFT (0U)
/*! EZHV_RSTSTVEC - Reset Value of CSRs STVEC */
#define SYSCON4_EZHV_RSTSTVEC_EZHV_RSTSTVEC(x)   (((uint32_t)(((uint32_t)(x)) << SYSCON4_EZHV_RSTSTVEC_EZHV_RSTSTVEC_SHIFT)) & SYSCON4_EZHV_RSTSTVEC_EZHV_RSTSTVEC_MASK)
/*! @} */

/*! @name EZHV_VOFFSET_T - EZH-V Interrupt Vector Offset */
/*! @{ */

#define SYSCON4_EZHV_VOFFSET_T_EZHV_VOFFSET_T_MASK (0x3FFFU)
#define SYSCON4_EZHV_VOFFSET_T_EZHV_VOFFSET_T_SHIFT (0U)
/*! EZHV_VOFFSET_T - Interrupt Vector Offset for Vectored Interrupts */
#define SYSCON4_EZHV_VOFFSET_T_EZHV_VOFFSET_T(x) (((uint32_t)(((uint32_t)(x)) << SYSCON4_EZHV_VOFFSET_T_EZHV_VOFFSET_T_SHIFT)) & SYSCON4_EZHV_VOFFSET_T_EZHV_VOFFSET_T_MASK)
/*! @} */

/*! @name EZHV2ARM_INT_EN - EZH-V To Arm Interrupt Enable */
/*! @{ */

#define SYSCON4_EZHV2ARM_INT_EN_INT_EN_MASK      (0xFFFFU)
#define SYSCON4_EZHV2ARM_INT_EN_INT_EN_SHIFT     (0U)
/*! INT_EN - Interrupt Enable */
#define SYSCON4_EZHV2ARM_INT_EN_INT_EN(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON4_EZHV2ARM_INT_EN_INT_EN_SHIFT)) & SYSCON4_EZHV2ARM_INT_EN_INT_EN_MASK)

#define SYSCON4_EZHV2ARM_INT_EN_CPU0_RXEV_EN_MASK (0x10000U)
#define SYSCON4_EZHV2ARM_INT_EN_CPU0_RXEV_EN_SHIFT (16U)
/*! CPU0_RXEV_EN - CPU0 RXEV Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON4_EZHV2ARM_INT_EN_CPU0_RXEV_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON4_EZHV2ARM_INT_EN_CPU0_RXEV_EN_SHIFT)) & SYSCON4_EZHV2ARM_INT_EN_CPU0_RXEV_EN_MASK)

#define SYSCON4_EZHV2ARM_INT_EN_CPU1_RXEV_EN_MASK (0x20000U)
#define SYSCON4_EZHV2ARM_INT_EN_CPU1_RXEV_EN_SHIFT (17U)
/*! CPU1_RXEV_EN - CPU1 RXEV Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON4_EZHV2ARM_INT_EN_CPU1_RXEV_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON4_EZHV2ARM_INT_EN_CPU1_RXEV_EN_SHIFT)) & SYSCON4_EZHV2ARM_INT_EN_CPU1_RXEV_EN_MASK)
/*! @} */

/*! @name EZHV2ARM_INT_CHAN - EZH-V Interrupt Channel */
/*! @{ */

#define SYSCON4_EZHV2ARM_INT_CHAN_INT_CHAN_MASK  (0xFFFFU)
#define SYSCON4_EZHV2ARM_INT_CHAN_INT_CHAN_SHIFT (0U)
/*! INT_CHAN - EZH-V Interrupt Outputs */
#define SYSCON4_EZHV2ARM_INT_CHAN_INT_CHAN(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON4_EZHV2ARM_INT_CHAN_INT_CHAN_SHIFT)) & SYSCON4_EZHV2ARM_INT_CHAN_INT_CHAN_MASK)
/*! @} */

/*! @name ARM2EZHV_INT_CTRL - Arm To EZH-V Interrupt Control */
/*! @{ */

#define SYSCON4_ARM2EZHV_INT_CTRL_MEIP_MASK      (0x1U)
#define SYSCON4_ARM2EZHV_INT_CTRL_MEIP_SHIFT     (0U)
/*! MEIP - Machine External Input Interrupt Request
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON4_ARM2EZHV_INT_CTRL_MEIP(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON4_ARM2EZHV_INT_CTRL_MEIP_SHIFT)) & SYSCON4_ARM2EZHV_INT_CTRL_MEIP_MASK)

