nxp-mcuxpresso/mcux-sdk/devices/MIMXRT758S/MIMXRT758S_hifi1.h
#define XSPI_FR_RDADDR_MASK                      (0x2U)
#define XSPI_FR_RDADDR_SHIFT                     (1U)
/*! RDADDR - AHB Read Address Error Flag
 *  0b0..No error
 *  0b0..No action
 *  0b1..Error
 *  0b1..Clears flag
 */
#define XSPI_FR_RDADDR(x)                        (((uint32_t)(((uint32_t)(x)) << XSPI_FR_RDADDR_SHIFT)) & XSPI_FR_RDADDR_MASK)

#define XSPI_FR_PERFOVF_MASK                     (0x4U)
#define XSPI_FR_PERFOVF_SHIFT                    (2U)
/*! PERFOVF - AHB Performance Monitor Overflow Flag
 *  0b0..No overflow
 *  0b0..No action
 *  0b1..Overflow
 *  0b1..Clears flags
 */
#define XSPI_FR_PERFOVF(x)                       (((uint32_t)(((uint32_t)(x)) << XSPI_FR_PERFOVF_SHIFT)) & XSPI_FR_PERFOVF_MASK)

#define XSPI_FR_IPIEF_MASK                       (0x40U)
#define XSPI_FR_IPIEF_SHIFT                      (6U)
/*! IPIEF - IP Command Trigger Fail Error Flag
 *  0b0..No error
 *  0b0..No action
 *  0b1..Error
 *  0b1..Clears error flag
 */
#define XSPI_FR_IPIEF(x)                         (((uint32_t)(((uint32_t)(x)) << XSPI_FR_IPIEF_SHIFT)) & XSPI_FR_IPIEF_MASK)

#define XSPI_FR_PPWF_MASK                        (0x100U)
#define XSPI_FR_PPWF_SHIFT                       (8U)
/*! PPWF - Page-Program Wait Flag
 *  0b0..No page program wait
 *  0b0..No action
 *  0b1..Page program wait in effect
 *  0b1..Clears flag
 */
#define XSPI_FR_PPWF(x)                          (((uint32_t)(((uint32_t)(x)) << XSPI_FR_PPWF_SHIFT)) & XSPI_FR_PPWF_MASK)

#define XSPI_FR_ABOF_MASK                        (0x1000U)
#define XSPI_FR_ABOF_SHIFT                       (12U)
/*! ABOF - AHB Buffer Overflow Flag
 *  0b0..No overflow
 *  0b0..No action
 *  0b1..Overflow
 *  0b1..Clears overflow flag
 */
#define XSPI_FR_ABOF(x)                          (((uint32_t)(((uint32_t)(x)) << XSPI_FR_ABOF_SHIFT)) & XSPI_FR_ABOF_MASK)

#define XSPI_FR_AIBSEF_MASK                      (0x2000U)
#define XSPI_FR_AIBSEF_SHIFT                     (13U)
/*! AIBSEF - AHB Illegal Burst Size Error Flag
 *  0b0..No error
 *  0b0..No action
 *  0b1..Error
 *  0b1..Clears error flag
 */
#define XSPI_FR_AIBSEF(x)                        (((uint32_t)(((uint32_t)(x)) << XSPI_FR_AIBSEF_SHIFT)) & XSPI_FR_AIBSEF_MASK)

#define XSPI_FR_AITEF_MASK                       (0x4000U)
#define XSPI_FR_AITEF_SHIFT                      (14U)
/*! AITEF - AHB Illegal Transaction Error Flag
 *  0b0..No error
 *  0b0..No action
 *  0b1..Error
 *  0b1..Clears error flag
 */
#define XSPI_FR_AITEF(x)                         (((uint32_t)(((uint32_t)(x)) << XSPI_FR_AITEF_SHIFT)) & XSPI_FR_AITEF_MASK)

#define XSPI_FR_AAEF_MASK                        (0x8000U)
#define XSPI_FR_AAEF_SHIFT                       (15U)
/*! AAEF - AHB Abort Error Flag
 *  0b0..No error
 *  0b0..No action
 *  0b1..Error
 *  0b1..Clears error flag
 */
#define XSPI_FR_AAEF(x)                          (((uint32_t)(((uint32_t)(x)) << XSPI_FR_AAEF_SHIFT)) & XSPI_FR_AAEF_MASK)

#define XSPI_FR_RBDF_MASK                        (0x10000U)
#define XSPI_FR_RBDF_SHIFT                       (16U)
/*! RBDF - RX Buffer Drain Flag
 *  0b0..RX buffer is not over the watermark
 *  0b0..No action
 *  0b1..RX buffer is over the watermark
 *  0b1..Clears flag if RX buffer is not over the watermark after POP
 */
#define XSPI_FR_RBDF(x)                          (((uint32_t)(((uint32_t)(x)) << XSPI_FR_RBDF_SHIFT)) & XSPI_FR_RBDF_MASK)

#define XSPI_FR_RBOF_MASK                        (0x20000U)
#define XSPI_FR_RBOF_SHIFT                       (17U)
/*! RBOF - RX Buffer Overflow Flag
 *  0b0..No overflow
 *  0b0..No action
 *  0b1..Overflow
 *  0b1..Clears flag
 */
#define XSPI_FR_RBOF(x)                          (((uint32_t)(((uint32_t)(x)) << XSPI_FR_RBOF_SHIFT)) & XSPI_FR_RBOF_MASK)

#define XSPI_FR_ILLINE_MASK                      (0x800000U)
#define XSPI_FR_ILLINE_SHIFT                     (23U)
/*! ILLINE - Illegal Instruction Error Flag
 *  0b0..No error
 *  0b0..No action
 *  0b1..Error
 *  0b1..Clears error flag
 */
#define XSPI_FR_ILLINE(x)                        (((uint32_t)(((uint32_t)(x)) << XSPI_FR_ILLINE_SHIFT)) & XSPI_FR_ILLINE_MASK)

#define XSPI_FR_DLLUNLCK_MASK                    (0x1000000U)
#define XSPI_FR_DLLUNLCK_SHIFT                   (24U)
/*! DLLUNLCK - DLL Unlock
 *  0b0..No unlock event
 *  0b0..No action
 *  0b1..Unlock event has occurred
 *  0b1..Clears the flag
 */
#define XSPI_FR_DLLUNLCK(x)                      (((uint32_t)(((uint32_t)(x)) << XSPI_FR_DLLUNLCK_SHIFT)) & XSPI_FR_DLLUNLCK_MASK)

#define XSPI_FR_TBUF_MASK                        (0x4000000U)
#define XSPI_FR_TBUF_SHIFT                       (26U)
/*! TBUF - TX Buffer Underrun Flag
 *  0b0..No underrun
 *  0b0..No action
 *  0b1..Underrun
 *  0b1..Clears flag
 */
#define XSPI_FR_TBUF(x)                          (((uint32_t)(((uint32_t)(x)) << XSPI_FR_TBUF_SHIFT)) & XSPI_FR_TBUF_MASK)

#define XSPI_FR_TBFF_MASK                        (0x8000000U)
#define XSPI_FR_TBFF_SHIFT                       (27U)
/*! TBFF - TX Buffer Fill Flag
 *  0b0..No room in the TX buffer
 *  0b0..No action
 *  0b1..TX buffer has room
 *  0b1..Clears flag
 */
#define XSPI_FR_TBFF(x)                          (((uint32_t)(((uint32_t)(x)) << XSPI_FR_TBFF_SHIFT)) & XSPI_FR_TBFF_MASK)

#define XSPI_FR_DLLABRT_MASK                     (0x10000000U)
#define XSPI_FR_DLLABRT_SHIFT                    (28U)
/*! DLLABRT - DLL Terminate
 *  0b0..No lock has occurred
 *  0b0..No action
 *  0b1..DLL unlock occurred
 *  0b1..Clears flag
 */
#define XSPI_FR_DLLABRT(x)                       (((uint32_t)(((uint32_t)(x)) << XSPI_FR_DLLABRT_SHIFT)) & XSPI_FR_DLLABRT_MASK)

#define XSPI_FR_DLPFF_MASK                       (0x80000000U)
#define XSPI_FR_DLPFF_SHIFT                      (31U)
/*! DLPFF - Data Learning Pattern Failure Flag
 *  0b0..No failure
 *  0b0..No action
 *  0b1..Failure
 *  0b1..Clears flag
 */
#define XSPI_FR_DLPFF(x)                         (((uint32_t)(((uint32_t)(x)) << XSPI_FR_DLPFF_SHIFT)) & XSPI_FR_DLPFF_MASK)
/*! @} */

/*! @name RSER - Interrupt and DMA Request Enable */
/*! @{ */

#define XSPI_RSER_TFIE_MASK                      (0x1U)
#define XSPI_RSER_TFIE_SHIFT                     (0U)
/*! TFIE - Transaction Finished Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define XSPI_RSER_TFIE(x)                        (((uint32_t)(((uint32_t)(x)) << XSPI_RSER_TFIE_SHIFT)) & XSPI_RSER_TFIE_MASK)

#define XSPI_RSER_RDADDRIE_MASK                  (0x2U)
#define XSPI_RSER_RDADDRIE_SHIFT                 (1U)
/*! RDADDRIE - AHB Read Address Error Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define XSPI_RSER_RDADDRIE(x)                    (((uint32_t)(((uint32_t)(x)) << XSPI_RSER_RDADDRIE_SHIFT)) & XSPI_RSER_RDADDRIE_MASK)

#define XSPI_RSER_PERFOVIE_MASK                  (0x4U)
#define XSPI_RSER_PERFOVIE_SHIFT                 (2U)
/*! PERFOVIE - AHB Performance Monitor Overflow Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define XSPI_RSER_PERFOVIE(x)                    (((uint32_t)(((uint32_t)(x)) << XSPI_RSER_PERFOVIE_SHIFT)) & XSPI_RSER_PERFOVIE_MASK)

